espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
// Copyright 2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Control/Status registers */
/** Type of gotgctl register
 *  OTG Control and Status Register
 */
typedef volatile struct {
    /** sesreqscs : RO; bitpos: [0]; default: 0;
     *  Session Request Success.The core sets this bit when a session request initiation is
     *  successful
     */
    uint32_t sesreqscs: 1;
    /** sesreq : R/W; bitpos: [1]; default: 0;
     *  Session Request.The application sets this bit to initiate a session request on the
     *  USB. The application can clear this bit by writing a 0 when the Host Negotiation
     *  Success Status Change bit in the OTG Interrupt register
     *  (GOTGINT_REG.USB_HSTNEGSUCSTSCHNG) is SET. The core clears this bit when the
     *  USB_HSTNEGSUCSTSCHNG bit is cleared
     */
    uint32_t sesreq: 1;
    /** vbvalidoven : R/W; bitpos: [2]; default: 0;
     *  VBUS Valid Override Enable
     *  1'b1 : Internally Bvalid received from the PHY is overridden with
     *  GOTGCTL_REG.REG_VBVALIDOVVAl
     *  1'b0 : Override is disabled and bvalid signal from the respective PHY selected is
     *  used internally by the controller
     */
    uint32_t vbvalidoven: 1;
    /** vbvalidovval : R/W; bitpos: [3]; default: 0;
     *  VBUS Valid OverrideValue
     *  1'b0 : vbusvalid value is 1'b0 when GOTGCTL_REG.USB_VBVALIDOVEN =1
     *  1'b1 : vbusvalid value is 1'b1 when GOTGCTL_REG.USB_VBVALIDOVEN =1
     */
    uint32_t vbvalidovval: 1;
    /** avalidoven : R/W; bitpos: [4]; default: 0;
     *  This bit is used to enable/disable the software to override the Avalid signal using
     *  the GOTGCTL.AVALIDOVVAL
     *  1'b1: Internally Avalid received from the PHY is overridden with
     *  GOTGCTL_REG.REG_AVALIDOVVAL
     *  1'b0: Override is disabled and avalid signal from the respective PHY selected is
     *  used internally by the core
     */
    uint32_t avalidoven: 1;
    /** avalidovval : R/W; bitpos: [5]; default: 0;
     *  A-Peripheral Session Valid OverrideValue
     *  1'b0 : Avalid value is 1'b0 when GOTGCTL_REG.USB_AVALIDOVEN =1
     *  1'b1 : Avalid value is 1'b1 when GOTGCTL_REG.USB_AVALIDOVEN =1
     */
    uint32_t avalidovval: 1;
    /** bvalidoven : R/W; bitpos: [6]; default: 0;
     *  This bit is used to enable/disable the software to override the Bvalid signal using
     *  the GOTGCTLREG.BVALIDOVVAL
     *  1'b1 : Internally Bvalid received from the PHY is overridden with
     *  GOTGCTL_REG.USB_BVALIDOVVAL
     *  1'b0 : Override is disabled and bvalid signal from the respective PHY selected is
     *  used internally by the force
     */
    uint32_t bvalidoven: 1;
    /** bvalidovval : R/W; bitpos: [7]; default: 0;
     *  B-Peripheral Session Valid OverrideValue
     *  1'b0 : Bvalid value is 1'b0 when GOTGCTL_REG.USB_BVALIDOVEN =1
     *  1'b1 : Bvalid value is 1'b1 when GOTGCTL_REG.USB_BVALIDOVEN =1
     */
    uint32_t bvalidovval: 1;
    /** hstnegscs : RO; bitpos: [8]; default: 0;
     *  Host Negotiation Success.The controller sets this bit when host negotiation is
     *  successful. The controller clears this bit when the HNP Request (HNPReq) bit in
     *  this register is set.
     */
    uint32_t hstnegscs: 1;
    /** hnpreq : R/W; bitpos: [9]; default: 0;
     *  HNP Request .The application sets this bit to initiate an HNP request to the
     *  Connected USB host. The application can clear this bit by writing a 0 when the Host
     *  Negotiation Success Status Change bit in the OTG Interrupt register
     *  (GOTGINT_REG.HSTNEGSUCSTSCHNG) is SET. The controller clears this bit when the
     *  HSTNEGSUCSTSCHNG bit is cleared.
     */
    uint32_t hnpreq: 1;
    /** hstsethnpen : R/W; bitpos: [10]; default: 0;
     *  Host Set HNP Enable.The application sets this bit when it has successfully enabled
     *  HNP (using the SetFeature.SetHNPEnable command) on the connected device
     *  1'b0: Host Set HNP is not enabled
     *  1'b1: Host Set HNP is enabled
     */
    uint32_t hstsethnpen: 1;
    /** devhnpen : R/W; bitpos: [11]; default: 0;
     *  Device HNP Enabled.The application sets this bit when it successfully receives a
     *  SetFeature.SetHNPEnable command from the connected USB host
     *  1'b0: HNP is not enabled in the application
     *  1'b1: HNP is enabled in the application
     */
    uint32_t devhnpen: 1;
    /** ehen : R/W; bitpos: [12]; default: 0;
     *  Embedded Host Enable.It is used to select between OTG A Device state Machine and
     *  Embedded Host state machine
     *  1'b0: OTG A Device state machine is selected
     *  1'b1: Embedded Host State Machine is selected
     */
    uint32_t ehen: 1;
    uint32_t reserved_13: 2
    /** dbncefltrbypass : R/W; bitpos: [15]; default: 0;
     *  Bypass Debounce filters for avalid, bvalid, vbusvalid, sessend, iddig signals when
     *  enabled
     *  1'b0: Disabled
     *  1'b1: Enabled
     */
    uint32_t dbncefltrbypass: 1;
    /** conidsts : RO; bitpos: [16]; default: 0;
     *  Connector ID Status. Indicates the connector ID status on a connect event
     *  1'b0: The core is in A-Device mode
     *  1'b1: The core is in B-Device mode
     */
    uint32_t conidsts: 1;
    /** dbnctime : RO; bitpos: [17]; default: 0;
     *  Long/Short Debounce Time. Indicates the debounce time of a detected connection
     *  1'b0: Long debounce time, used for physical connections (100ms + 2.5 micro-sec)
     *  1'b1: Short debounce time, used for soft connections (2.5 micro-sec)
     */
    uint32_t dbnctime: 1;
    /** asesvld : RO; bitpos: [18]; default: 0;
     *  A-Session Valid. Indicates the Host mode transceiver status
     *  1'b0: A-session is not valid
     *  1'b1: A-session is valid
     */
    uint32_t asesvld: 1;
    /** bsesvld : RO; bitpos: [19]; default: 0;
     *  B-Session Valid.Indicates the Device mode transceiver status
     *  1'b0: B-session is not valid
     *  1'b1: B-session is valid
     */
    uint32_t bsesvld: 1;
    /** otgver : R/W; bitpos: [20]; default: 0;
     *  OTG Version
     *  1'b0:Supports OTG Version 1.3
     *  1'b1:Supports OTG Version 2.0
     */
    uint32_t otgver: 1;
    /** curmod : RO; bitpos: [21]; default: 0;
     *  Current Mode of Operation
     *  1'b0: Device mode
     *  1'b1:Host mode
     */
    uint32_t curmod: 1;


} usb_gotgctl_reg_t;

/** Type of gdfifocfg register
 *  Global DFIFO Configuration Register
 */
typedef volatile struct {
    /** gdfifocfg : R/W; bitpos: [16:0]; default: 0;
     *  GDFIFOCfg
     */
    uint32_t gdfifocfg: 16;
    /** epinfobaseaddr : R/W; bitpos: [32:16]; default: 0;
     *  EPInfoBaseAddr
     */
    uint32_t epinfobaseaddr: 16;


