espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
} usb_gdfifocfg_reg_t;

/** Type of hptxfsiz register
 *  Host Periodic Transmit FIFO Size Register
 */
typedef volatile struct {
    /** ptxfstaddr : R/W; bitpos: [16:0]; default: 512;
     *  Host Periodic TxFIFO Start Address.
     */
    uint32_t ptxfstaddr: 16;
    /** ptxfsize : R/W; bitpos: [32:16]; default: 4096;
     *  Host Periodic TxFIFO Depth,This value is in terms of 32-bit words..
     */
    uint32_t ptxfsize: 16;


} usb_hptxfsiz_reg_t;

/** Type of dieptxfn register
 *  Device IN Endpoint Transmit FIFO Size Register
 */
typedef volatile struct {
    /** inepntxfstaddr : R/W; bitpos: [16:0]; default: 512;
     *  IN Endpoint FIFOn Transmit RAM Start Address.
     */
    uint32_t inepntxfstaddr: 16;
    /** inepntxfdep : R/W; bitpos: [32:16]; default: 4096;
     *  IN Endpoint TxFIFO Depth
     */
    uint32_t inepntxfdep: 16;


} usb_dieptxfn_reg_t;

/** Type of hcfg register
 *  Host Configuration Register
 */
typedef volatile struct {
    /** h_fslspclksel : R/W; bitpos: [2:0]; default: 0;
     *  0x0 : PHY clock is running at 30/60 MHz
     *  0x1 : PHY clock is running at 48 MHz
     *  0x2 : PHY clock is running at 6 MHz
     */
    uint32_t h_fslspclksel: 2;
    /** h_fslssupp : R/W; bitpos: [2]; default: 0;
     *  FS- and LS-Only Support
     *  1'b0: HS/FS/LS, based on the maximum speed supported by the connected device
     *  1'b1: FS/LS-only, even If the connected device can support HS
     */
    uint32_t h_fslssupp: 1;
    uint32_t reserved_3: 4
    /** h_ena32khzs : R/W; bitpos: [7]; default: 0;
     *  1'b0:32 KHz Suspend mode disabled
     *  1'b1:32 KHz Suspend mode enabled
     */
    uint32_t h_ena32khzs: 1;
    uint32_t reserved_8: 15
    /** h_descdma : R/W; bitpos: [23]; default: 0;
     *  GAHBCFG_REG.USB_DMAEN=0,HCFG_REG.USB_DESCDMA=0 => Slave mode
     *  GAHBCFG_REG.USB_DMAEN=0,HCFG_REG.USB_DESCDMA=1 => Invalid
     *  GAHBCFG_REG.USB_DMAEN=1,HCFG_REG.USB_DESCDMA=0 => Buffered DMA
     *  GAHBCFG_REG.USB_DMAEN=1,HCFG_REG.USB_DESCDMA=1 => Scatter/Gather DMA mode
     */
    uint32_t h_descdma: 1;
    /** h_frlisten : R/W; bitpos: [26:24]; default: 0;
     *  Frame List Entries
     *  2'b00: 8 Entries
     *  2'b01: 16 Entries
     *  2'b10: 32 Entries
     *  2'b11: 64 Entries
     */
    uint32_t h_frlisten: 2;
    /** h_perschedena : R/W; bitpos: [26]; default: 0;
     *  0x0 (DISABLED): Disables periodic scheduling within the core
     *  0x1 (ENABLED): Enables periodic scheduling within the core
     */
    uint32_t h_perschedena: 1;
    uint32_t reserved_27: 4
    /** h_modechtimen : R/W; bitpos: [31]; default: 0;
     *  Mode Change Ready Timer Enable,
     *  1'b0 : The Host core waits for either 200 PHY clock cycles or a linestate of SE0 at
     *  the end of resume to the change the opmode from 2'b10 to 2'b00.
     *  1'b1 : The Host core waits only for a linstate of SE0 at the end of resume to
     *  change the opmode from 2'b10 to 2'b00.
     */
    uint32_t h_modechtimen: 1;


} usb_hcfg_reg_t;

/** Type of hfir register
 *  Host Frame Interval Register
 */
typedef volatile struct {
    /** frint : R/W; bitpos: [16:0]; default: 6103;
     *  Frame Interval .  1 ms * (PHY clock frequency for FS/LS)
     */
    uint32_t frint: 16;
    /** hfirrldctrl : R/W; bitpos: [16]; default: 0;
     *  Reload Control
     *  1'b0 : The HFIR cannot be reloaded dynamically
     *  1'b1: the HFIR can be dynamically reloaded during runtime
     */
    uint32_t hfirrldctrl: 1;


} usb_hfir_reg_t;

/** Type of hflbaddr register
 *  Host Frame List Base Address Register
 */
typedef volatile struct {
    /** hflbaddr : R/W; bitpos: [32:0]; default: 0;
     *  The starting address of the Frame list. This register is used only for Isochronous
     *  and Interrupt Channels.
     */
    uint32_t hflbaddr: 32;


} usb_hflbaddr_reg_t;

/** Type of hprt register
 *  Host Port Control and Status Register
 */
typedef volatile struct {
    /** prtconnsts : RO; bitpos: [0]; default: 0;
     *  Port Connect Status
     *  0x0: No device is attached to the port
     *  0x1: A device is attached to the port
     */
    uint32_t prtconnsts: 1;
    /** prtconndet : R/W; bitpos: [1]; default: 0;
     *  Port Connect Detected.
     *  0x1 : Device connection detected.
     *  0x0 : No device connection detected.
     */
    uint32_t prtconndet: 1;
    /** prtena : R/W; bitpos: [2]; default: 0;
     *  Port Enable
     *  1'b0: Port disabled
     *  1'b1: Port enabled
     */
    uint32_t prtena: 1;
    /** prtenchng : R/W; bitpos: [3]; default: 0;
     *  Port Enable/Disable Change
     *  0x0 : Port Enable bit 2 has not changed
     *  0x1 : Port Enable bit 2 changed
     */
    uint32_t prtenchng: 1;
    /** prtovrcurract : RO; bitpos: [4]; default: 0;
     *  Port Overcurrent Active
     *  1'b0: No overcurrent condition
     *  1'b1: Overcurrent condition
     */
    uint32_t prtovrcurract: 1;
    /** prtovrcurrchng : R/W; bitpos: [5]; default: 0;
     *  Port Overcurrent Change
     *  0x0: Status of port overcurrent status is not changed
     *  0x1: Status of port overcurrent changed
     */
    uint32_t prtovrcurrchng: 1;
    /** prtres : R/W; bitpos: [6]; default: 0;
     *  Port Resume
     *  1'b0: No resume driven
     *  1'b1: Resume driven
     */
    uint32_t prtres: 1;
    /** prtsusp : R/W; bitpos: [7]; default: 0;
     *  Port Suspend
     *  1'b0: Port not in Suspend mode
     *  1'b1: Port in Suspend mode
     */
    uint32_t prtsusp: 1;
    /** prtrst : R/W; bitpos: [8]; default: 0;
     *  Port Reset.
     *  1'b0: Port not in reset
     *  1'b1: Port in reset
     */
    uint32_t prtrst: 1;
    uint32_t reserved_9: 1
    /** prtlnsts : RO; bitpos: [12:10]; default: 0;
     *  Port Line Status
     *  Bit [10]: Logic level of D+
     *  Bit [11]: Logic level of D-
     */
    uint32_t prtlnsts: 2;
    /** prtpwr : R/W; bitpos: [12]; default: 0;
     *  Port Power
     *  1'b0: Power off
     *  1'b1: Power on
     */
    uint32_t prtpwr: 1;
    /** prttstctl : R/W; bitpos: [17:13]; default: 0;
     *  Port Test Control
     *  4'b0000: Test mode disabled
     *  4'b0001: Test_J mode
     *  4'b0010: Test_K mode
     *  4'b0011: Test_SE0_NAK mode
     *  4'b0100: Test_Packet mode
     *  4'b0101: Test_Force_Enable
     *  Others: Reserved
     */
    uint32_t prttstctl: 4;
    /** prtspd : RO; bitpos: [19:17]; default: 0;
     *  Port Speed
     *  2'b00: High speed
     *  2'b01: Full speed
     *  2'b10: Low speed
     *  2'b11: Reserved
     */
    uint32_t prtspd: 2;


