espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
} usb_hprt_reg_t;

/** Type of hccharn register
 *  Host Channel n Characteristics Register
 */
typedef volatile struct {
    /** h_mpsn : R/W; bitpos: [11:0]; default: 0;
     *  Maximum Packet Size.
     */
    uint32_t h_mpsn: 11;
    /** h_epnumn : R/W; bitpos: [15:11]; default: 0;
     *  Endpoint Number.
     */
    uint32_t h_epnumn: 4;
    /** h_epdirn : R/W; bitpos: [15]; default: 0;
     *  1'b0: OUT
     *  1'b1: IN
     */
    uint32_t h_epdirn: 1;
    uint32_t reserved_16: 1
    /** h_lspddevn : R/W; bitpos: [17]; default: 0;
     *  0x0: Not Communicating with low speed device
     *  0x1: Communicating with low speed device
     */
    uint32_t h_lspddevn: 1;
    /** h_eptypen : R/W; bitpos: [20:18]; default: 0;
     *  0x0 (CTRL): Contro
     *  0x1 (ISOC): Isochronous
     *  0x2 (BULK): Bulk
     *  0x3 (INTERR): Interrupt
     */
    uint32_t h_eptypen: 2;
    uint32_t reserved_20: 1
    /** h_ecn : R/W; bitpos: [21]; default: 0;
     *  Multi Count (MC) / Error Count(EC)
     *  0x0 (RESERVED): Reserved. This field yields undefined result
     *  0x1 (TRANSONE): 1 transaction
     *  0x2 (TRANSTWO):2 transactions to be issued for this endpoint per microframe
     *  0x3 (TRANSTHREE): 3 transactions to be issued for this endpoint per microframe
     */
    uint32_t h_ecn: 1;
    /** h_devaddrn : R/W; bitpos: [29:22]; default: 0;
     *  Device Address .    This field selects the specific device serving as the data
     *  source or sink.
     */
    uint32_t h_devaddrn: 7;
    /** h_oddfrmn : R/W; bitpos: [29]; default: 0;
     *  Odd Frame
     *  1'b0: Even (micro)Frame
     *  1'b1: Odd (micro)Frame
     */
    uint32_t h_oddfrmn: 1;
    /** h_chdisn : R/W; bitpos: [30]; default: 0;
     *  Channel Disable
     *  0x0 : Transmit/Recieve norma
     *  0x1 : Stop transmitting/receiving data on channel
     */
    uint32_t h_chdisn: 1;
    /** h_chenan : R/W; bitpos: [31]; default: 0;
     *  Channel Enable
     *  0x0 :If Scatter/Gather mode is enabled, indicates that the descriptor structure is
     *  not yet ready. If Scatter/Gather mode is disabled, indicates that the channel is
     *  disabled
     *  0x1 : If Scatter/Gather mode is enabled, indicates that the descriptor structure
     *  and data buffer with data is set up and this channel can access the descriptor. If
     *  Scatter/Gather mode is disabled, indicates that the channel is enabled
     */
    uint32_t h_chenan: 1;


} usb_hccharn_reg_t;

/** Type of hcdman register
 *  Host Channel n DMA Address Register
 */
typedef volatile struct {
    /** h_dmaaddrn : R/W; bitpos: [32:0]; default: 0;
     *  In Scatter-Gather DMA (DescDMA) Mode for Non-Isochronous:
     *  [31:9]: DMA Address
     *  [8:3]: Current Transfer Desc
     *  [2:0]: Reserved
     */
    uint32_t h_dmaaddrn: 32;


} usb_hcdman_reg_t;

/** Type of dcfg register
 *  Device Configuration Register
 */
typedef volatile struct {
    uint32_t reserved_0: 2
    /** nzstsouthshk : R/W; bitpos: [2]; default: 0;
     *  1'b0: Send the received OUT packet to the application (zero-length or non-zero
     *  length) and send a handshake based on NAK and STALL bits for the endpoint in the
     *  Devce Endpoint Control Register
     *  1'b1: Send a STALL handshake on a nonzero-length status OUT transaction and do not
     *  send the received OUT packet to the application
     */
    uint32_t nzstsouthshk: 1;
    uint32_t reserved_3: 1
    /** devaddr : R/W; bitpos: [11:4]; default: 0;
     *  Device Address.
     */
    uint32_t devaddr: 7;
    /** perfrlint : R/W; bitpos: [13:11]; default: 0;
     *  0x0 (EOPF80): 80% of the (micro)Frame interval
     *  0x1 (EOPF85): 85% of the (micro)Frame interval
     *  0x2 (EOPF90): 90% of the (micro)Frame interval
     *  0x3 (EOPF95): 95% of the (micro)Frame interval
     */
    uint32_t perfrlint: 2;
    /** endevoutnak : R/W; bitpos: [13]; default: 0;
     *  1'b0:The core does not set NAK after Bulk OUT transfer complete
     *  1'b1: The core sets NAK after Bulk OUT transfer complete
     */
    uint32_t endevoutnak: 1;
    /** xcvrdly : R/W; bitpos: [14]; default: 0;
     *  0x0 : No delay between xcvr_sel and txvalid during Device chirp
     *  0x1 : Enable delay between xcvr_sel and txvalid during Device chirp
     */
    uint32_t xcvrdly: 1;
    /** erraticintmsk : R/W; bitpos: [15]; default: 0;
     *  0x0 : Early suspend interrupt is generated on erratic error
     *  0x1: Mask early suspend interrupt on erratic error
     */
    uint32_t erraticintmsk: 1;
    uint32_t reserved_16: 2
    /** epmiscnt : R/W; bitpos: [23:18]; default: 4;
     *  IN Endpoint Mismatch Count.
     */
    uint32_t epmiscnt: 5;
    /** descdma : R/W; bitpos: [23]; default: 0;
     *  1'b0: Disable Scatter/Gather DMA
     *  1'b1: Enable Scatter/Gather DMA
     */
    uint32_t descdma: 1;
    /** perschintvl : R/W; bitpos: [26:24]; default: 0;
     *  Periodic Scheduling Interval
     *  0x0 (MF25): 25% of (micro)Frame
     *  0x1 (MF50): 50% of (micro)Frame
     *  0x2 (MF75): 75% of (micro)Frame
     *  0x3 (RESERVED): Reserved
     */
    uint32_t perschintvl: 2;
    /** resvalid : R/W; bitpos: [32:26]; default: 2;
     *  This field is effective only when DCFG.Ena32KHzSusp is set. It controls the resume
     *  period when the core resumes from suspend.
     *  The core counts for ResValid number of clock cycles to detect a valid resume when
     *  this bit is set
     */
    uint32_t resvalid: 6;


} usb_dcfg_reg_t;

/** Type of dctl register
 *  Device Control Register
 */
typedef volatile struct {
    /** rmtwkupsig : R/W; bitpos: [0]; default: 0;
     *  0x0 : Core does not send Remote Wakeup Signaling
     *  0x1 : Core sends Remote Wakeup Signalin
     */
    uint32_t rmtwkupsig: 1;
    /** sftdiscon : R/W; bitpos: [1]; default: 0;
     *  1'b0: Normal operation. When this bit is cleared after a soft disconnect, the core
     *  drives the phy_opmode_o signal on the UTMI+ to 2'b00, which generates a device
     *  connect event to the USB host. When the device is reconnected, the USB host
     *  restarts device enumeration
     *  1'b1: The core drives the phy_opmode_o signal on the UTMI+ to  2'b01, which
     *  generates a device disconnect event to the USB host
     */
    uint32_t sftdiscon: 1;
    /** gnpinnaksts : RO; bitpos: [2]; default: 0;
     *  0x0 : A handshake is sent out based on the data availability in the transmit FIFO
     *  0x1 : A NAK handshake is sent out on all non-periodic  IN endpoints, irrespective
     *  of the data availability in the transmit FIFO
     */
    uint32_t gnpinnaksts: 1;
    /** goutnaksts : RO; bitpos: [3]; default: 0;
     *  0x0 : A handshake is sent based on the FIFO Status and the NAK and STALL bit
     *  settings
     *  0x1 : No data is written to the RxFIFO, irrespective of  space availability. Sends
     *  a NAK handshake on all packets, except on SETUP transactions. All isochronous OUT
     *  packets are dropped
     */
    uint32_t goutnaksts: 1;
    /** tstctl : R/W; bitpos: [7:4]; default: 0;
     *  0x0: Test mode disabled
     *  0x1: Test_J mode
     *  0x2 : Test_K mode
     *  0x3 : Test_SE0_NAK mode
     *  0x4 : Test_Packet mode
     *  0x5 : Test_force_Enable
     */
    uint32_t tstctl: 3;
    /** sgnpinnak : WO; bitpos: [7]; default: 0;
     *  Set Global Non-periodic IN NAK. A write to this field sets the Global Non-periodic
     *  IN NAK.The application uses this bit to send a NAK handshake on all non-periodic IN
     *  endpoints. The core can also Set this bit when a timeout condition is detected on a
     *  non-periodic endpoint in shared FIFO operation. The application must Set this bit
     *  only after making sure that the Global IN NAK Effective bit in the Core Interrupt
     *  Register (GINTSTS.GINNakEff) is cleared
     */
    uint32_t sgnpinnak: 1;
    /** cgnpinnak : WO; bitpos: [8]; default: 0;
     *  Clear Global Non-periodic IN NAK. A write to this field clears the Global
     *  Non-periodic IN NAK.
     */
    uint32_t cgnpinnak: 1;
    /** sgoutnak : WO; bitpos: [9]; default: 0;
     *  Set Global OUT NAK. A write to this field sets the Global OUT NAK. The application
     *  uses this bit to send a NAK handshake on all OUT endpoints. The application must
     *  set the this bit only after making sure that the Global OUT NAK Effective bit in
     *  the Core Interrupt Register (GINTSTS.GOUTNakEff) is cleared.
     */
    uint32_t sgoutnak: 1;
    /** cgoutnak : WO; bitpos: [10]; default: 0;
     *  Clear Global OUT NAK. A write to this field clears the Global OUT NAK.
     */
    uint32_t cgoutnak: 1;
    /** pwronprgdone : R/W; bitpos: [11]; default: 0;
     *  1'b0: Power-On Programming not done
     *  1'b1: Power-On Programming Done
     */
    uint32_t pwronprgdone: 1;
    uint32_t reserved_12: 1
    /** gmc : R/W; bitpos: [15:13]; default: 1;
     *  Global Multi Count. applicable only for Scatter/Gather DMA mode
     *  0x0 : Invalid
     *  0x1 : 1 packet
     *  0x2 : 2 packets
     *  0x3 : 3 packets
     */
    uint32_t gmc: 2;
    /** ignrfrmnum : R/W; bitpos: [15]; default: 0;
     *  0: The core transmits the packets only in the frame number in which they are
     *  intended to be transmitted
     *  1: The core ignores the frame number, sending packets immediately as the packets
     *  are ready
     */
    uint32_t ignrfrmnum: 1;
    /** nakonbble : R/W; bitpos: [16]; default: 0;
     *  1'b0: Disable NAK on Babble Error
     *  1'b1: NAK on Babble Error
     */
    uint32_t nakonbble: 1;
    /** encountonbna : R/W; bitpos: [17]; default: 0;
     *  1'b0: After receiving BNA interrupt,the core disables the endpoint. When the
     *  endpoint is re-enabled by the application,the core starts processing from the
     *  DOEPDMA descriptor
     *  1'b1: After receiving BNA interrupt, the core disables the endpoint. When the
     *  endpoint is re-enabled by the application, the core starts processing from the
     *  descriptor that received the BNA interrupt
     */
    uint32_t encountonbna: 1;
    /** deepsleepbeslreject : R/W; bitpos: [18]; default: 0;
     *  1'b0: Deep Sleep BESL Reject feature is disabled
     *  1'b1: Deep Sleep BESL Reject feature is enabled
     */
    uint32_t deepsleepbeslreject: 1;


