espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
} usb_dctl_reg_t;

/** Type of dvbusdis register
 *  Device VBUS Discharge Time Register
 */
typedef volatile struct {
    /** dvbusdis : R/W; bitpos: [16:0]; default: 6103;
     *  Specifies the VBUS discharge time after VBUS pulsing during SRP. This value equals
     *  (VBUS discharge time in PHY clocks) / 1, 024. The value you use depends whether the
     *  PHY is operating at 30MHz (16-bit data width) or 60 MHz (8-bit data width).
     *  Depending on your VBUS load, this value can need adjustment.
     */
    uint32_t dvbusdis: 16;


} usb_dvbusdis_reg_t;

/** Type of dvbuspulse register
 *  Device VBUS Pulsing Time Register
 */
typedef volatile struct {
    /** dvbuspulse : R/W; bitpos: [12:0]; default: 1464;
     *  Specifies the VBUS pulsing time during SRP. This value equals (VBUS pulsing time in
     *  PHY clocks) / 1, 024 The value you use depends whether the PHY is operating at
     *  30MHz (16-bit data width) or 60 MHz (8-bit data width).
     */
    uint32_t dvbuspulse: 12;


} usb_dvbuspulse_reg_t;

/** Type of dthrctl register
 *  Device Threshold Control Register
 */
typedef volatile struct {
    /** nonisothren : R/W; bitpos: [0]; default: 0;
     *  Non-ISO IN Endpoints Threshold Enable
     *  0x0 : No thresholding
     *  0x1 : Enable thresholding for non-isochronous IN endpoints
     */
    uint32_t nonisothren: 1;
    /** isothren : R/W; bitpos: [1]; default: 0;
     *  ISO IN Endpoints Threshold Enable
     *  0x0 : No thresholding
     *  0x1 : Enables thresholding for isochronous IN endpoints
     */
    uint32_t isothren: 1;
    /** txthrlen : R/W; bitpos: [11:2]; default: 8;
     *  This field specifies Transmit thresholding size in DWORDS. This also forms the MAC
     *  threshold and specifies the amount of data in bytes to be in the corresponding
     *  endpoint transmit FIFO, before the core can start transmit on the USB. The
     *  threshold length has to be at least eight DWORDS when the value of AHBThrRatio is
     *  2'h00. In case the AHBThrRatio is non zero the application needs to ensure that the
     *  AHB Threshold value does not go below the recommended eight DWORD. This field
     *  controls both isochronous and non-isochronous IN endpoint thresholds. The
     *  recommended value for ThrLen is to be the same as the programmed AHB Burst Length
     *  (GAHBCFG.HBstLen).
     */
    uint32_t txthrlen: 9;
    /** ahbthrratio : R/W; bitpos: [13:11]; default: 0;
     *  2'b00: AHB threshold = MAC threshold
     *  2'b01: AHB threshold = MAC threshold/2
     *  2'b10: AHB threshold = MAC threshold/4
     *  2'b11: AHB threshold = MAC threshold/8
     */
    uint32_t ahbthrratio: 2;
    uint32_t reserved_13: 3
    /** rxthren : R/W; bitpos: [16]; default: 0;
     *  0x0 : Disable thresholding
     *  0x1 : Enable thresholding in the receive direction
     */
    uint32_t rxthren: 1;
    /** rxthrlen : R/W; bitpos: [26:17]; default: 1;
     *  Receive Threshold Length.  This field specifies Receive thresholding size in
     *  DWORDS. This field also specifies the amount of data received on the USB before the
     *  core can start transmitting on the AHB. The threshold length has to be at least
     *  eight DWORDS. The recommended value for ThrLen is to be the same as the programmed
     *  AHB Burst Length(GAHBCFG.HBstLen).
     */
    uint32_t rxthrlen: 9;
    uint32_t reserved_26: 1
    /** arbprken : R/W; bitpos: [27]; default: 1;
     *  0x0 : Disable DMA arbiter parking
     *  0x1 : Enable DMA arbiter parking for IN endpoints
     */
    uint32_t arbprken: 1;


} usb_dthrctl_reg_t;

/** Type of diepctl0 register
 *  Device Control IN Endpoint $n Control Register
 */
typedef volatile struct {
    /** d_mps0 : R/W; bitpos: [2:0]; default: 0;
     *  Maximum Packet Size
     *  0x0 : 64 bytes
     *  0x1 : 32 bytes
     *  0x2 : 16 bytes
     *  0x3 : 8 bytes
     */
    uint32_t d_mps0: 2;
    uint32_t reserved_2: 13
    /** d_usbactep0 : RO; bitpos: [15]; default: 1;
     *  USB Active Endpoint
     *  0x1 : Control endpoint is always active
     */
    uint32_t d_usbactep0: 1;
    uint32_t reserved_16: 1
    /** d_naksts0 : RO; bitpos: [17]; default: 0;
     *  NAK Status
     *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
     *  0x1 : The core is transmitting NAK handshakes on this endpoint
     */
    uint32_t d_naksts0: 1;
    /** d_eptype0 : RO; bitpos: [20:18]; default: 0;
     *  Endpoint Type
     *  0x0 : Endpoint Control 0
     */
    uint32_t d_eptype0: 2;
    uint32_t reserved_20: 1
    /** d_stall0 : R/W; bitpos: [21]; default: 0;
     *  The application can only set this bit, and the core clears it
     *  0x0 : No Stall
     *  0x1 : Stall Handshake
     */
    uint32_t d_stall0: 1;
    /** d_txfnum0 : R/W; bitpos: [26:22]; default: 0;
     *  TxFIFO Number.
     */
    uint32_t d_txfnum0: 4;
    /** d_cnak0 : WO; bitpos: [26]; default: 0;
     *  A write to this bit clears the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Clear NAK
     */
    uint32_t d_cnak0: 1;
    /** di_snak0 : WO; bitpos: [27]; default: 0;
     *  A write to this bit sets the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Set NAK
     */
    uint32_t di_snak0: 1;
    uint32_t reserved_28: 2
    /** d_epdis0 : R/W; bitpos: [30]; default: 0;
     *  Endpoint Disable
     *  0x0 : No action
     *  0x1 : Disabled Endpoint
     */
    uint32_t d_epdis0: 1;
    /** d_epena0 : R/W; bitpos: [31]; default: 0;
     *  Endpoint Enable
     *  0x0 : No action
     *  0x1 : Enable Endpoint
     */
    uint32_t d_epena0: 1;


} usb_diepctl0_reg_t;

/** Type of dieptsizn register
 *  Device IN Endpoint n Transfer Size Register
 */
typedef volatile struct {
    /** d_xfersizen : R/W; bitpos: [7:0]; default: 0;
     *  Transfer Size
     *  IN Endpoints: The core decrements this field every time a packet from the external
     *  memory is written to the TxFIFO
     *  OUT Endpoints: The core decrements this field every time a  packet is read from the
     *  RxFIFO and written to the external memory
     */
    uint32_t d_xfersizen: 7;
    uint32_t reserved_7: 12
    /** d_pktcntn : R/W; bitpos: [21:19]; default: 0;
     *  Packet Count
     *  IN Endpoints : This field is decremented every time a packet (maximum size or short
     *  packet) is read from the TxFIFO
     *  OUT Endpoints: This field is decremented every time a packet (maximum size or short
     *  packet) is written to the RxFIFO
     */
    uint32_t d_pktcntn: 2;


} usb_dieptsizn_reg_t;

/** Type of diepdman register
 *  Device IN Endpoint n DMA Address Register
 */
typedef volatile struct {
    /** d_dmaaddrn : R/W; bitpos: [32:0]; default: 0;
     *  This field holds the start address of the external memory for storing or fetching
     *  endpoint data.
     */
    uint32_t d_dmaaddrn: 32;


} usb_diepdman_reg_t;

/** Type of diepctl1 register
 *  Device Control IN Endpoint $n Control Register
 */
typedef volatile struct {
    /** d_mps1 : R/W; bitpos: [2:0]; default: 0;
     *  Maximum Packet Size
     *  0x0 : 64 bytes
     *  0x1 : 32 bytes
     *  0x2 : 16 bytes
     *  0x3 : 8 bytes
     */
    uint32_t d_mps1: 2;
    uint32_t reserved_2: 13
    /** d_usbactep1 : RO; bitpos: [15]; default: 1;
     *  USB Active Endpoint
     *  0x1 : Control endpoint is always active
     */
    uint32_t d_usbactep1: 1;
    uint32_t reserved_16: 1
    /** d_naksts1 : RO; bitpos: [17]; default: 0;
     *  NAK Status
     *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
     *  0x1 : The core is transmitting NAK handshakes on this endpoint
     */
    uint32_t d_naksts1: 1;
    /** d_eptype1 : RO; bitpos: [20:18]; default: 0;
     *  Endpoint Type
     *  0x0 : Endpoint Control 0
     */
    uint32_t d_eptype1: 2;
    uint32_t reserved_20: 1
    /** d_stall1 : R/W; bitpos: [21]; default: 0;
     *  The application can only set this bit, and the core clears it
     *  0x0 : No Stall
     *  0x1 : Stall Handshake
     */
    uint32_t d_stall1: 1;
    /** d_txfnum1 : R/W; bitpos: [26:22]; default: 0;
     *  TxFIFO Number.
     */
    uint32_t d_txfnum1: 4;
    /** d_cnak1 : WO; bitpos: [26]; default: 0;
     *  A write to this bit clears the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Clear NAK
     */
    uint32_t d_cnak1: 1;
    /** di_snak1 : WO; bitpos: [27]; default: 0;
     *  A write to this bit sets the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Set NAK
     */
    uint32_t di_snak1: 1;
    /** di_setd0pid1 : WO; bitpos: [28]; default: 0;
     *  Set DATA0 PID
     */
    uint32_t di_setd0pid1: 1;
    /** di_setd1pid1 : WO; bitpos: [29]; default: 0;
     *  Set DATA1 PID
     */
    uint32_t di_setd1pid1: 1;
    /** d_epdis1 : R/W; bitpos: [30]; default: 0;
     *  Endpoint Disable
     *  0x0 : No action
     *  0x1 : Disabled Endpoint
     */
    uint32_t d_epdis1: 1;
    /** d_epena1 : R/W; bitpos: [31]; default: 0;
     *  Endpoint Enable
     *  0x0 : No action
     *  0x1 : Enable Endpoint
     */
    uint32_t d_epena1: 1;


} usb_diepctl1_reg_t;

/** Type of diepctl2 register
 *  Device Control IN Endpoint 2 Control Register
 */
typedef volatile struct {
    /** d_mps2 : R/W; bitpos: [2:0]; default: 0;
     *  Maximum Packet Size
     *  0x0 : 64 bytes
     *  0x1 : 32 bytes
     *  0x2 : 16 bytes
     *  0x3 : 8 bytes
     */
    uint32_t d_mps2: 2;
    uint32_t reserved_2: 13
    /** d_usbactep2 : RO; bitpos: [15]; default: 1;
     *  USB Active Endpoint
     *  0x1 : Control endpoint is always active
     */
    uint32_t d_usbactep2: 1;
    uint32_t reserved_16: 1
    /** d_naksts2 : RO; bitpos: [17]; default: 0;
     *  NAK Status
     *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
     *  0x1 : The core is transmitting NAK handshakes on this endpoint
     */
    uint32_t d_naksts2: 1;
    /** d_eptype2 : RO; bitpos: [20:18]; default: 0;
     *  Endpoint Type
     *  0x0 : Endpoint Control 0
     */
    uint32_t d_eptype2: 2;
    uint32_t reserved_20: 1
    /** d_stall2 : R/W; bitpos: [21]; default: 0;
     *  The application can only set this bit, and the core clears it
     *  0x0 : No Stall
     *  0x1 : Stall Handshake
     */
    uint32_t d_stall2: 1;
    /** d_txfnum2 : R/W; bitpos: [26:22]; default: 0;
     *  TxFIFO Number.
     */
    uint32_t d_txfnum2: 4;
    /** d_cnak2 : WO; bitpos: [26]; default: 0;
     *  A write to this bit clears the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Clear NAK
     */
    uint32_t d_cnak2: 1;
    /** di_snak2 : WO; bitpos: [27]; default: 0;
     *  A write to this bit sets the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Set NAK
     */
    uint32_t di_snak2: 1;
    /** di_setd0pid2 : WO; bitpos: [28]; default: 0;
     *  Set DATA0 PID
     */
    uint32_t di_setd0pid2: 1;
    /** di_setd1pid2 : WO; bitpos: [29]; default: 0;
     *  Set DATA1 PID
     */
    uint32_t di_setd1pid2: 1;
    /** d_epdis2 : R/W; bitpos: [30]; default: 0;
     *  Endpoint Disable
     *  0x0 : No action
     *  0x1 : Disabled Endpoint
     */
    uint32_t d_epdis2: 1;
    /** d_epena2 : R/W; bitpos: [31]; default: 0;
     *  Endpoint Enable
     *  0x0 : No action
     *  0x1 : Enable Endpoint
     */
    uint32_t d_epena2: 1;


