espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
} usb_diepctl2_reg_t;

/** Type of diepctl3 register
 *  Device Control IN Endpoint $n Control Register
 */
typedef volatile struct {
    /** di_mps3 : R/W; bitpos: [2:0]; default: 0;
     *  Maximum Packet Size
     *  0x0 : 64 bytes
     *  0x1 : 32 bytes
     *  0x2 : 16 bytes
     *  0x3 : 8 bytes
     */
    uint32_t di_mps3: 2;
    uint32_t reserved_2: 13
    /** di_usbactep3 : RO; bitpos: [15]; default: 1;
     *  USB Active Endpoint
     *  0x1 : Control endpoint is always active
     */
    uint32_t di_usbactep3: 1;
    uint32_t reserved_16: 1
    /** di_naksts3 : RO; bitpos: [17]; default: 0;
     *  NAK Status
     *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
     *  0x1 : The core is transmitting NAK handshakes on this endpoint
     */
    uint32_t di_naksts3: 1;
    /** di_eptype3 : RO; bitpos: [20:18]; default: 0;
     *  Endpoint Type
     *  0x0 : Endpoint Control 0
     */
    uint32_t di_eptype3: 2;
    uint32_t reserved_20: 1
    /** di_stall3 : R/W; bitpos: [21]; default: 0;
     *  The application can only set this bit, and the core clears it
     *  0x0 : No Stall
     *  0x1 : Stall Handshake
     */
    uint32_t di_stall3: 1;
    /** di_txfnum3 : R/W; bitpos: [26:22]; default: 0;
     *  TxFIFO Number.
     */
    uint32_t di_txfnum3: 4;
    /** di_cnak3 : WO; bitpos: [26]; default: 0;
     *  A write to this bit clears the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Clear NAK
     */
    uint32_t di_cnak3: 1;
    /** di_snak3 : WO; bitpos: [27]; default: 0;
     *  A write to this bit sets the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Set NAK
     */
    uint32_t di_snak3: 1;
    /** di_setd0pid3 : WO; bitpos: [28]; default: 0;
     *  Set DATA0 PID
     */
    uint32_t di_setd0pid3: 1;
    /** di_setd1pid3 : WO; bitpos: [29]; default: 0;
     *  Set DATA1 PID
     */
    uint32_t di_setd1pid3: 1;
    /** di_epdis3 : R/W; bitpos: [30]; default: 0;
     *  Endpoint Disable
     *  0x0 : No action
     *  0x1 : Disabled Endpoint
     */
    uint32_t di_epdis3: 1;
    /** di_epena3 : R/W; bitpos: [31]; default: 0;
     *  Endpoint Enable
     *  0x0 : No action
     *  0x1 : Enable Endpoint
     */
    uint32_t di_epena3: 1;


} usb_diepctl3_reg_t;

/** Type of diepctl4 register
 *  Device Control IN Endpoint $n Control Register
 */
typedef volatile struct {
    /** d_mps4 : R/W; bitpos: [2:0]; default: 0;
     *  Maximum Packet Size
     *  0x0 : 64 bytes
     *  0x1 : 32 bytes
     *  0x2 : 16 bytes
     *  0x3 : 8 bytes
     */
    uint32_t d_mps4: 2;
    uint32_t reserved_2: 13
    /** d_usbactep4 : RO; bitpos: [15]; default: 1;
     *  USB Active Endpoint
     *  0x1 : Control endpoint is always active
     */
    uint32_t d_usbactep4: 1;
    uint32_t reserved_16: 1
    /** d_naksts4 : RO; bitpos: [17]; default: 0;
     *  NAK Status
     *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
     *  0x1 : The core is transmitting NAK handshakes on this endpoint
     */
    uint32_t d_naksts4: 1;
    /** d_eptype4 : RO; bitpos: [20:18]; default: 0;
     *  Endpoint Type
     *  0x0 : Endpoint Control 0
     */
    uint32_t d_eptype4: 2;
    uint32_t reserved_20: 1
    /** d_stall4 : R/W; bitpos: [21]; default: 0;
     *  The application can only set this bit, and the core clears it
     *  0x0 : No Stall
     *  0x1 : Stall Handshake
     */
    uint32_t d_stall4: 1;
    /** d_txfnum4 : R/W; bitpos: [26:22]; default: 0;
     *  TxFIFO Number.
     */
    uint32_t d_txfnum4: 4;
    /** d_cnak4 : WO; bitpos: [26]; default: 0;
     *  A write to this bit clears the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Clear NAK
     */
    uint32_t d_cnak4: 1;
    /** di_snak4 : WO; bitpos: [27]; default: 0;
     *  A write to this bit sets the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Set NAK
     */
    uint32_t di_snak4: 1;
    /** di_setd0pid4 : WO; bitpos: [28]; default: 0;
     *  Set DATA0 PID
     */
    uint32_t di_setd0pid4: 1;
    /** di_setd1pid4 : WO; bitpos: [29]; default: 0;
     *  Set DATA1 PID
     */
    uint32_t di_setd1pid4: 1;
    /** d_epdis4 : R/W; bitpos: [30]; default: 0;
     *  Endpoint Disable
     *  0x0 : No action
     *  0x1 : Disabled Endpoint
     */
    uint32_t d_epdis4: 1;
    /** d_epena4 : R/W; bitpos: [31]; default: 0;
     *  Endpoint Enable
     *  0x0 : No action
     *  0x1 : Enable Endpoint
     */
    uint32_t d_epena4: 1;


} usb_diepctl4_reg_t;

/** Type of diepctl5 register
 *  Device Control IN Endpoint $n Control Register
 */
typedef volatile struct {
    /** di_mps5 : R/W; bitpos: [2:0]; default: 0;
     *  Maximum Packet Size
     *  0x0 : 64 bytes
     *  0x1 : 32 bytes
     *  0x2 : 16 bytes
     *  0x3 : 8 bytes
     */
    uint32_t di_mps5: 2;
    uint32_t reserved_2: 13
    /** di_usbactep5 : RO; bitpos: [15]; default: 1;
     *  USB Active Endpoint
     *  0x1 : Control endpoint is always active
     */
    uint32_t di_usbactep5: 1;
    uint32_t reserved_16: 1
    /** di_naksts5 : RO; bitpos: [17]; default: 0;
     *  NAK Status
     *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
     *  0x1 : The core is transmitting NAK handshakes on this endpoint
     */
    uint32_t di_naksts5: 1;
    /** di_eptype5 : RO; bitpos: [20:18]; default: 0;
     *  Endpoint Type
     *  0x0 : Endpoint Control 0
     */
    uint32_t di_eptype5: 2;
    uint32_t reserved_20: 1
    /** di_stall5 : R/W; bitpos: [21]; default: 0;
     *  The application can only set this bit, and the core clears it
     *  0x0 : No Stall
     *  0x1 : Stall Handshake
     */
    uint32_t di_stall5: 1;
    /** di_txfnum5 : R/W; bitpos: [26:22]; default: 0;
     *  TxFIFO Number.
     */
    uint32_t di_txfnum5: 4;
    /** di_cnak5 : WO; bitpos: [26]; default: 0;
     *  A write to this bit clears the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Clear NAK
     */
    uint32_t di_cnak5: 1;
    /** di_snak5 : WO; bitpos: [27]; default: 0;
     *  A write to this bit sets the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Set NAK
     */
    uint32_t di_snak5: 1;
    /** di_setd0pid5 : WO; bitpos: [28]; default: 0;
     *  Set DATA0 PID
     */
    uint32_t di_setd0pid5: 1;
    /** di_setd1pid5 : WO; bitpos: [29]; default: 0;
     *  Set DATA1 PID
     */
    uint32_t di_setd1pid5: 1;
    /** di_epdis5 : R/W; bitpos: [30]; default: 0;
     *  Endpoint Disable
     *  0x0 : No action
     *  0x1 : Disabled Endpoint
     */
    uint32_t di_epdis5: 1;
    /** di_epena5 : R/W; bitpos: [31]; default: 0;
     *  Endpoint Enable
     *  0x0 : No action
     *  0x1 : Enable Endpoint
     */
    uint32_t di_epena5: 1;


} usb_diepctl5_reg_t;

/** Type of diepctl6 register
 *  Device Control IN Endpoint $n Control Register
 */
typedef volatile struct {
    /** d_mps6 : R/W; bitpos: [2:0]; default: 0;
     *  Maximum Packet Size
     *  0x0 : 64 bytes
     *  0x1 : 32 bytes
     *  0x2 : 16 bytes
     *  0x3 : 8 bytes
     */
    uint32_t d_mps6: 2;
    uint32_t reserved_2: 13
    /** d_usbactep6 : RO; bitpos: [15]; default: 1;
     *  USB Active Endpoint
     *  0x1 : Control endpoint is always active
     */
    uint32_t d_usbactep6: 1;
    uint32_t reserved_16: 1
    /** d_naksts6 : RO; bitpos: [17]; default: 0;
     *  NAK Status
     *  0x0 : The core is transmitting non-NAK handshakes based on the FIFO Status
     *  0x1 : The core is transmitting NAK handshakes on this endpoint
     */
    uint32_t d_naksts6: 1;
    /** d_eptype6 : RO; bitpos: [20:18]; default: 0;
     *  Endpoint Type
     *  0x0 : Endpoint Control 0
     */
    uint32_t d_eptype6: 2;
    uint32_t reserved_20: 1
    /** d_stall6 : R/W; bitpos: [21]; default: 0;
     *  The application can only set this bit, and the core clears it
     *  0x0 : No Stall
     *  0x1 : Stall Handshake
     */
    uint32_t d_stall6: 1;
    /** d_txfnum6 : R/W; bitpos: [26:22]; default: 0;
     *  TxFIFO Number.
     */
    uint32_t d_txfnum6: 4;
    /** d_cnak6 : WO; bitpos: [26]; default: 0;
     *  A write to this bit clears the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Clear NAK
     */
    uint32_t d_cnak6: 1;
    /** di_snak6 : WO; bitpos: [27]; default: 0;
     *  A write to this bit sets the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Set NAK
     */
    uint32_t di_snak6: 1;
    /** di_setd0pid6 : WO; bitpos: [28]; default: 0;
     *  Set DATA0 PID
     */
    uint32_t di_setd0pid6: 1;
    /** di_setd1pid6 : WO; bitpos: [29]; default: 0;
     *  Set DATA1 PID
     */
    uint32_t di_setd1pid6: 1;
    /** d_epdis6 : R/W; bitpos: [30]; default: 0;
     *  Endpoint Disable
     *  0x0 : No action
     *  0x1 : Disabled Endpoint
     */
    uint32_t d_epdis6: 1;
    /** d_epena6 : R/W; bitpos: [31]; default: 0;
     *  Endpoint Enable
     *  0x0 : No action
     *  0x1 : Enable Endpoint
     */
    uint32_t d_epena6: 1;


} usb_diepctl6_reg_t;

