espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
/** Type of doepctl0 register
 *  Device Control OUT Endpoint $n Control Register
 */
typedef volatile struct {
    /** mps0 : RO; bitpos: [2:0]; default: 0;
     *  Maximum Packet Size
     *  0x0 : 64 bytes
     *  0x1 : 32 bytes
     *  0x2 : 16 bytes
     *  0x3 : 8 bytes
     */
    uint32_t mps0: 2;
    uint32_t reserved_2: 13
    /** usbactep0 : RO; bitpos: [15]; default: 1;
     *  0x1: USB Active Endpoint 0
     */
    uint32_t usbactep0: 1;
    uint32_t reserved_16: 1
    /** naksts0 : RO; bitpos: [17]; default: 0;
     *  0x0 :  The core is transmitting non-NAK handshakes based on the FIFO status
     *  0x1 :The core is transmitting NAK handshakes on this endpoint
     */
    uint32_t naksts0: 1;
    /** eptype0 : RO; bitpos: [20:18]; default: 0;
     *  Endpoint Type
     *  0x0 : Endpoint Control $n
     */
    uint32_t eptype0: 2;
    /** snp0 : R/W; bitpos: [20]; default: 0;
     *  0x0 : Reserved 0
     *  0x1 : Reserved 1
     */
    uint32_t snp0: 1;
    /** stall0 : R/W; bitpos: [21]; default: 0;
     *  The application can only set this bit, and the core clears it, when a SETUP token
     *  is received for this endpoint
     *  0x0 (INACTIVE): No Stall
     *  0x1 (ACTIVE): Stall Handshake
     */
    uint32_t stall0: 1;
    uint32_t reserved_22: 4
    /** cnak0 : WO; bitpos: [26]; default: 0;
     *  0x0 : No action
     *  0x1 : Clear NAK
     */
    uint32_t cnak0: 1;
    /** do_snak0 : WO; bitpos: [27]; default: 0;
     *  0x0 : No action
     *  0x1 : Set NAK
     */
    uint32_t do_snak0: 1;
    uint32_t reserved_28: 2
    /** epdis0 : RO; bitpos: [30]; default: 0;
     *  Endpoint Disable
     *  0x0 : No Endpoint disable
     */
    uint32_t epdis0: 1;
    /** epena0 : R/W; bitpos: [31]; default: 0;
     *  Endpoint Enable
     *  0x0 : No action
     *  0x1 : Enable Endpoint
     */
    uint32_t epena0: 1;


} usb_doepctl0_reg_t;

/** Type of doeptsizn register
 *  Device OUT Endpoint n Transfer Size Register
 */
typedef volatile struct {
    /** xfersizen : R/W; bitpos: [7:0]; default: 0;
     *  Transfer Size.Indicates the transfer size in bytes for ENDPOINTn
     */
    uint32_t xfersizen: 7;
    uint32_t reserved_7: 12
    /** pktcntn : R/W; bitpos: [19]; default: 0;
     *  Packet Count (PktCnt).This field is decremented to zero after a packet is written
     *  into the RxFIFO.
     */
    uint32_t pktcntn: 1;
    uint32_t reserved_20: 9
    /** supcntn : R/W; bitpos: [31:29]; default: 0;
     *  SETUP Packet Count (SUPCnt).This field specifies the number of back-to-back SETUP
     *  data packets the endpoint can receive
     *  2'b01: 1 packet
     *  2'b10: 2 packets
     *  2'b11: 3 packets
     */
    uint32_t supcntn: 2;


} usb_doeptsizn_reg_t;

/** Type of doepdman register
 *  Device OUT Endpoint n DMA Address Register
 */
typedef volatile struct {
    /** dmaaddrn : R/W; bitpos: [32:0]; default: 0;
     *  Holds the start address of the external memory for storing or fetching endpoint
     *  data.
     */
    uint32_t dmaaddrn: 32;


} usb_doepdman_reg_t;

/** Type of doepdmabn register
 *  Device OUT Endpoint 16 Buffer Address Register
 */
typedef volatile struct {
    /** dmabufferaddrn : R/W; bitpos: [32:0]; default: 0;
     *  Holds the current buffer address.This register is updated as and when the data
     *  transfer for the corresponding end point is in progress. This register is present
     *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
     */
    uint32_t dmabufferaddrn: 32;


} usb_doepdmabn_reg_t;

/** Type of doepctln register
 *  Device Control OUT Endpoint n Control Register
 */
typedef volatile struct {
    /** mpsn : RO; bitpos: [11:0]; default: 0;
     *  Maximum Packet Size in bytes
     */
    uint32_t mpsn: 11;
    uint32_t reserved_11: 4
    /** usbactepn : RO; bitpos: [15]; default: 1;
     *  0x1: USB Active Endpoint 0
     */
    uint32_t usbactepn: 1;
    uint32_t reserved_16: 1
    /** nakstsn : RO; bitpos: [17]; default: 0;
     *  0x0 :  The core is transmitting non-NAK handshakes based on the FIFO status
     *  0x1 :The core is transmitting NAK handshakes on this endpoint
     */
    uint32_t nakstsn: 1;
    /** eptypen : RO; bitpos: [20:18]; default: 0;
     *  Endpoint Type
     *  0x0 : Endpoint Control n
     */
    uint32_t eptypen: 2;
    /** snpn : R/W; bitpos: [20]; default: 0;
     *  0x0 : Reserved 0
     *  0x1 : Reserved 1
     */
    uint32_t snpn: 1;
    /** stalln : R/W; bitpos: [21]; default: 0;
     *  The application can only set this bit, and the core clears it, when a SETUP token
     *  is received for this endpoint
     *  0x0 (INACTIVE): No Stall
     *  0x1 (ACTIVE): Stall Handshake
     */
    uint32_t stalln: 1;
    uint32_t reserved_22: 4
    /** cnakn : WO; bitpos: [26]; default: 0;
     *  0x0 : No action
     *  0x1 : Clear NAK
     */
    uint32_t cnakn: 1;
    /** do_snakn : WO; bitpos: [27]; default: 0;
     *  A write to this bit sets the NAK bit for the endpoint
     *  0x0 : No action
     *  0x1 : Set NAK
     */
    uint32_t do_snakn: 1;
    /** do_setd0pidn : WO; bitpos: [28]; default: 0;
     *  Set DATA0 PID
     */
    uint32_t do_setd0pidn: 1;
    /** do_setd1pidn : WO; bitpos: [29]; default: 0;
     *  Set DATA1 PID
     */
    uint32_t do_setd1pidn: 1;
    /** epdisn : RO; bitpos: [30]; default: 0;
     *  Endpoint Disable
     *  0x0 : No Endpoint disable
     */
    uint32_t epdisn: 1;
    /** epenan : R/W; bitpos: [31]; default: 0;
     *  Endpoint Enable
     *  0x0 : No action
     *  0x1 : Enable Endpoint
     */
    uint32_t epenan: 1;


} usb_doepctln_reg_t;

/** Type of pcgcctl register
 *  Power and Clock Gating Control Register
 */
typedef volatile struct {
    /** stoppclk : R/W; bitpos: [0]; default: 0;
     *  0x0 : Disable Stop Pclk
     *  0x1 : Enable Stop Pclk
     */
    uint32_t stoppclk: 1;
    /** gatehclk : R/W; bitpos: [1]; default: 0;
     *  gate hclk
     *  0x0:clears this bit when USB is resumed or a new session starts
     *  0x1:set this bit to gate hclk to modules, when the USB is suspended or the session
     *  is not valid
     */
    uint32_t gatehclk: 1;
    /** pwrclmp : R/W; bitpos: [2]; default: 0;
     *  0x0:Clears this bit to disable the clamping before the power is turned on
     *  0x1:In only Partial Power-Down mode, sets this bit to clamp the signals between the
     *  power-on modules and the power-off modules before the power is turned off
     */
    uint32_t pwrclmp: 1;
    /** rstpdwnmodule : R/W; bitpos: [3]; default: 0;
     *  Reset Power-Down Modules.
     *  0x0 : Power is turned on
     *  0x1 : Power is turned off
     */
    uint32_t rstpdwnmodule: 1;
    uint32_t reserved_4: 2
    /** physleep : RO; bitpos: [6]; default: 0;
     *  0x0 : Phy not in Sleep state
     *  0x1 : Phy in Sleep state
     */
    uint32_t physleep: 1;
    /** l1suspended : RO; bitpos: [7]; default: 0;
     *  L1 Deep Sleep
     *  0x0 : Non Deep Sleep
     *  0x1 : Deep Sleep
     */
    uint32_t l1suspended: 1;
    /** resetaftersusp : R/W; bitpos: [8]; default: 0;
     *  Reset after suspend
     *  0x0 : In Host-only mode, host issues Resume after Suspend
     *  0x1 : In Host-only mode, host sets this bit before clamp is removed if the host
     *  needs to issue Reset after Suspend
     */
    uint32_t resetaftersusp: 1;


} usb_pcgcctl_reg_t;



/** Interrupt registers */
/** Type of gotgint register
 *  OTG Interrupt Register
 */
typedef volatile struct {
    uint32_t reserved_0: 2
    /** sesenddet : R/W1C; bitpos: [2]; default: 0;
     *  Session End Detected.The controller sets this bit when the utmiotg_bvalid signal is
     *  deasserted. This bit can be set only by the core and the application should write 1
     *  to clear it
     */
    uint32_t sesenddet: 1;
    uint32_t reserved_3: 5
    /** sesreqsucstschng : R/W1C; bitpos: [8]; default: 0;
     *  Session Request Success Status Change.The core sets this bit on the success or
     *  failure of a session request.The application must read the Session Request Success
     *  bit in the OTG Control and Status register (GOTGCTL_REG.USB_SESREQSCS) to check for
     *  success or failure. This bit can be set only by the core and the application should
     *  write 1 to clear it.
     */
    uint32_t sesreqsucstschng: 1;
    /** hstnegsucstschng : R/W1C; bitpos: [9]; default: 0;
     *  Host Negotiation Success Status Change. The core sets this bit on the success or
     *  failure of a USB host negotiation request. The application must read the Host
     *  Negotiation Success bit of the OTG Control and Status register
     *  (GOTGCTL_REG.USB_HSTNEGSCS) to check for success or failure. This bit can be set
     *  only by the core and the application should write 1 to clear it
     */
    uint32_t hstnegsucstschng: 1;
    uint32_t reserved_10: 7
    /** hstnegdet : R/W1C; bitpos: [17]; default: 0;
     *  Host Negotiation Detected.The core sets this bit when it detects a host negotiation
     *  request on the USB. This bit can be set only by the core and the application should
     *  write 1 to clear it.
     */
    uint32_t hstnegdet: 1;
    /** adevtoutchg : R/W1C; bitpos: [18]; default: 0;
     *  A-Device Timeout Change. The core sets this bit to indicate that the A-device has
     *  timed out while waiting for the B-device to connect.This bit can be set only by the
     *  core and the application should write 1 to clear it
     */
    uint32_t adevtoutchg: 1;
    /** dbncedone : R/W1C; bitpos: [19]; default: 0;
     *  Debounce Done. The core sets this bit when the debounce is completed after the
     *  device connect. The application can start driving USB reset after seeing this
     *  interrupt. This bit is only valid when the HNP Capable or SRP Capable bit is SET in
     *  the Core USB Configuration register (GUSBCFG.HNPCap or GUSBCFG.SRPCap,
     *  respectively). This bit can be set only by the core and the application should
     *  write 1 to clear it
     */
    uint32_t dbncedone: 1;


} usb_gotgint_reg_t;

/** Type of gintsts register
 *  Interrupt Register
 */
typedef volatile struct {
    /** curmod_int : RO; bitpos: [0]; default: 0;
     *  Current Mode of Operation
     *  1'b0: Device mode
     *  1'b1: Host mode
     */
    uint32_t curmod_int: 1;
    /** modemis : R/W1C; bitpos: [1]; default: 0;
     *  Mode Mismatch Interrupt.The core sets this bit when the application is trying to
     *  access:A Host mode register, when the controller is operating in Device mode
     */
    uint32_t modemis: 1;
    /** otgint : RO; bitpos: [2]; default: 0;
     *  OTG Interrupt.The controller sets this bit to indicate an OTG protocol event. The
     *  application must read the OTG Interrupt Status (GOTGINT_REG) register to determine
     *  the exact event that caused this interrupt. The application must clear the
     *  appropriate status bit in the GOTGINT_REG register to clear this bit.
     */
    uint32_t otgint: 1;
    /** sof : R/W1C; bitpos: [3]; default: 0;
     *  Start of (micro)Frame (Sof)
     *  In Host mode, the core sets this bit to indicate that an SOF (FS), micro-SOF (HS),
     *  or Keep-Alive (LS) is transmitted on the USB. The application must write a 1 to
     *  this bit to clear the interrupt
     *  In Device mode, the controller sets this bit to indicate that an SOF token has been
     *  received on the USB. The application can read the Device Status register to get the
     *  current (micro)Frame number. This Interrupt is seen only when the core is operating
     *  at either HS or FS. This bit can be set only by the core and the application must
     *  write 1 to clear it
     */
    uint32_t sof: 1;
    /** rxflvi : RO; bitpos: [4]; default: 0;
     *  RxFIFO Non-Empty.Indicates that there is at least one packet pending to be read
     *  from the RxFIFO
     *  1'b0: Rx Fifo is empty
     *  1'b1: Rx Fifo is not empty
     */
    uint32_t rxflvi: 1;
    /** nptxfemp : RO; bitpos: [5]; default: 0;
     *  Non-periodic TxFIFO Empty.This interrupt is asserted when the Non-periodic TxFIFO
     *  is either half or completely empty, and there is space for at least one Entry to be
     *  written to the Non-periodic Transmit Request Queue. The half or completely empty
     *  status is determined by the Non-periodic TxFIFO Empty Level bit in the Core AHB
     *  Configuration register (GAHBCFG_REG.USB_NPTXFEMPLVL).
     */
    uint32_t nptxfemp: 1;
    /** ginnakeff : RO; bitpos: [6]; default: 0;
     *  Device only.Global IN Non-periodic NAK Effective.Indicates that the Set Global
     *  Non-periodic IN NAK bit in the Device Control register (DCTL.SGNPInNak) set by the
     *  application, has taken effect in the core. That is, the core has sampled the Global
     *  IN NAK bit Set by the application. This bit can be cleared by clearing the Clear
     *  Global Non-periodic IN NAK bit in the Device Control register (DCTL.CGNPInNak).
     *  This interrupt does not necessarily mean that a NAK handshake is sent out on the
     *  USB. The STALL bit takes precedence over the NAK bit.
     */
    uint32_t ginnakeff: 1;
    /** goutnakeff : RO; bitpos: [7]; default: 0;
     *  Device only.Global OUT NAK Effective.Indicates that the Set Global OUT NAK bit in
     *  the Device Control register (DCTL_REG.USB_SGOUTNAK), Set by the application, has
     *  taken effect in the core. This bit can be cleared by writing the Clear Global OUT
     *  NAK bit in the Device Control register (DCTL_REG.REG_CGOUTNAK).
     */
    uint32_t goutnakeff: 1;
    uint32_t reserved_8: 2
    /** erlysusp : R/W1C; bitpos: [10]; default: 0;
     *  Device only.Early Suspend.The controller sets this bit to indicate that an Idle
     *  state has been detected on the USB for 3 ms.
     */
    uint32_t erlysusp: 1;
    /** usbsusp : R/W1C; bitpos: [11]; default: 0;
     *  Device only.USB Suspend.The controller sets this bit to indicate that a suspend was
     *  detected on the USB. The controller enters the Suspended state when there is no
     *  activity on the linestate signal for an extended period of time.
     */
    uint32_t usbsusp: 1;
    /** usbrst : R/W1C; bitpos: [12]; default: 0;
     *  Device only.USB Reset.The controller sets this bit to indicate that a reset is
     *  detected on the USB
     */
    uint32_t usbrst: 1;
    /** enumdone : R/W1C; bitpos: [13]; default: 0;
     *  Device only.Enumeration Done.The core sets this bit to indicate that speed
     *  enumeration is complete. The application must read the Device Status (DSTS_REG)
     *  register to obtain the enumerated speed.
     */
    uint32_t enumdone: 1;
    /** isooutdrop : R/W1C; bitpos: [14]; default: 0;
     *  Device only.Isochronous OUT Packet Dropped Interrupt.The controller sets this bit
     *  when it fails to write an isochronous OUT packet into the RxFIFO because the RxFIFO
     *  does not have enough space to accommodate a maximum packet size packet for the
     *  isochronous OUT endpoint.
     */
    uint32_t isooutdrop: 1;
    /** eopf : R/W1C; bitpos: [15]; default: 0;
     *  Device only.End of Periodic Frame Interrupt.Indicates that the period specified in
     *  the Periodic Frame Interval field of the Device Configuration register
     *  (DCFG_REG.REG_PERFRINT) has been reached in the current microframe.
     */
    uint32_t eopf: 1;
    uint32_t reserved_16: 1
    /** epmis : R/W1C; bitpos: [17]; default: 0;
     *  Device only.Endpoint Mismatch Interrupt.This interrupt is valid only in shared FIFO
     *  operation.Indicates that an IN token has been received for a non-periodic endpoint,
     *  but the data for another endpoint is present in the top of the Non-periodic
     *  Transmit FIFO and the IN endpoint mismatch count programmed by the application has
     *  expired.
     */
    uint32_t epmis: 1;
    /** iepint : RO; bitpos: [18]; default: 0;
     *  Device only.IN Endpoints Interrupt.The core sets this bit to indicate that an
     *  interrupt is pending on one of the IN endpoints of the core (in Device mode). The
     *  application must read the Device All Endpoints Interrupt (DAINT) register to
     *  determine the exact number of the IN endpoint on Device IN Endpoint-n Interrupt
     *  (DIEPINTn) register to determine the exact cause of the interrupt. The application
     *  must clear the appropriate status bit in the corresponding DIEPINTn register to
     *  clear this bit.
     */
    uint32_t iepint: 1;
    /** oepint : RO; bitpos: [19]; default: 0;
     *  Device only.OUT Endpoints Interrupt.The controller sets this bit to indicate that
     *  an interrupt is pending on one of the OUT endpoints of the core (in Device mode).
     *  The application must read the Device All Endpoints Interrupt (DAINT) register to
     *  determine the exact number of the OUT endpoint on which the interrupt occurred, and
     *  then read the corresponding Device OUT Endpoint-n Interrupt (DOEPINTn) register to
     *  determine the exact cause of the interrupt. The application must clear the
     *  appropriate status bit in the corresponding DOEPINTn register to clear this bit.
     */
    uint32_t oepint: 1;
    /** incompisoin : R/W1C; bitpos: [20]; default: 0;
     *  Device only.Incomplete Isochronous IN Transfer.The core sets this interrupt to
     *  indicate that there is at least one isochronous IN endpoint on which the transfer
     *  is not completed in the current microframe. This interrupt is asserted along with
     *  the End of Periodic Frame Interrupt (EOPF) bit in this register.
     */
    uint32_t incompisoin: 1;
    /** incompip : R/W1C; bitpos: [21]; default: 0;
     *  In Host mode, the core sets this interrupt bit when there are incomplete periodic
     *  transactions still pending which are scheduled for the current microframe.The
     *  Device mode, the core sets this interrupt to indicate that thereis at least one
     *  isochronous OUT endpoint on which the transfer is not completed in the current
     *  microframe. This interrupt is asserted along with the End of Periodic Frame
     *  Interrupt (EOPF) bit in this register.
     */
    uint32_t incompip: 1;
    /** fetsusp : R/W1C; bitpos: [22]; default: 0;
     *  Device only.Data Fetch Suspended.This interrupt is valid only in DMA mode. This
     *  interrupt indicates that the core has stopped fetching data. For IN endpoints due
     *  to the unavailability of TxFIFO space or Request Queue space. This interrupt is
     *  used by the application for an endpoint mismatch algorithm
     */
    uint32_t fetsusp: 1;
    /** resetdet : R/W1C; bitpos: [23]; default: 0;
     *  Reset detected Interrupt
     *  In Device mode, this interrupt is asserted when a reset is detected on the USB in
     *  partial power-down mode when the device is in Suspend
     *  In Host mode, this interrupt is not asserted
     */
    uint32_t resetdet: 1;
    /** prtlnt : RO; bitpos: [24]; default: 0;
     *  Host only.Host Port Interrupt.The core sets this bit to indicate a change in port
     *  status of one of the controller ports in Host mode. The application must read the
     *  Host Port Control and Status (HPRT) register to determine the exact event that
     *  caused this interrupt. The application must clear the appropriate status bit in the
     *  Host Port Control and Status register to clear this bit.
     */
    uint32_t prtlnt: 1;
    /** hchlnt : RO; bitpos: [25]; default: 0;
     *  Host only.Host Channels Interrupt.The core sets this bit to indicate that an
     *  interrupt is pending on one of the channels of the core (in Host mode). The
     *  application must read the Host All Channels Interrupt (HAINT) register to determine
     *  the exact number of the channel on which the interrupt occurred,and Then read the
     *  corresponding Host Channel-n Interrupt (HCINTn) register to determine the exact
     *  cause of the interrupt.The application must clear the appropriate status bit in the
     *  HCINTn register to clear this bit.
     */
    uint32_t hchlnt: 1;
    /** ptxfemp : RO; bitpos: [26]; default: 0;
     *  Host only.Periodic TxFIFO Empty.This interrupt is asserted when the Periodic
     *  Transmit FIFO is either half or completely empty and there is space for at least
     *  one entry to be written in the Periodic Request Queue. The half or completelyempty
     *  status is determined by the Periodic TxFIFO Empty Level bit in the Core AHB
     *  Configuration register (GAHBCFG.PTxFEmpLvl)
     */
    uint32_t ptxfemp: 1;
    uint32_t reserved_27: 1
    /** conidstschng : R/W1C; bitpos: [28]; default: 0;
     *  Connector ID Status Change
     *  1'b0:Not active
     *  1'b1:Connector ID Status Change
     */
    uint32_t conidstschng: 1;
    /** disconnint : R/W1C; bitpos: [29]; default: 0;
     *  Disconnect Detected Interrupt
     *  1'b0:Not active
     *  1'b1:Disconnect Detected Interrupt
     */
    uint32_t disconnint: 1;
    /** sessreqint : R/W1C; bitpos: [30]; default: 0;
     *  1'b0:Not active
     *  1'b1:Session Request New Session Detected
     */
    uint32_t sessreqint: 1;
    /** wkupint : R/W1C; bitpos: [31]; default: 0;
     *  Resume/Remote Wakeup Detected Interrupt
     *  1'b0:Not active
     *  1'b1:Resume or Remote Wakeup Detected Interrupt
     */
    uint32_t wkupint: 1;


} usb_gintsts_reg_t;

