espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
/** Type of gintmsk register
 *  Interrupt Mask Register
 */
typedef volatile struct {
    uint32_t reserved_0: 1
    /** modemismsk : R/W; bitpos: [1]; default: 0;
     *  1'b0:Mode Mismatch Interrupt Mask
     *  1'b1:No Mode Mismatch Interrupt Mask
     */
    uint32_t modemismsk: 1;
    /** otgintmsk : R/W; bitpos: [2]; default: 0;
     *  1'b0:OTG Interrupt Mask
     *  1'b1:No OTG Interrupt Mask
     */
    uint32_t otgintmsk: 1;
    /** sofmsk : R/W; bitpos: [3]; default: 0;
     *  1'b0:Start of (micro)Frame Mask
     *  1'b1:No Start of (micro)Frame Mask
     */
    uint32_t sofmsk: 1;
    /** rxflvimsk : R/W; bitpos: [4]; default: 0;
     *  1'b0:Receive FIFO Non-Empty Mask
     *  1'b1:No Receive FIFO Non-Empty Mask
     */
    uint32_t rxflvimsk: 1;
    /** nptxfempmsk : R/W; bitpos: [5]; default: 0;
     *  1'b0:Non-periodic TxFIFO Empty Mask
     *  1'b1:No Non-periodic TxFIFO Empty Mask
     */
    uint32_t nptxfempmsk: 1;
    /** ginnakeffmsk : R/W; bitpos: [6]; default: 0;
     *  1'b0:Global Non-periodic IN NAK Effective Mask
     *  1'b1:No Global Non-periodic IN NAK Effective Mask
     */
    uint32_t ginnakeffmsk: 1;
    /** goutnackeffmsk : R/W; bitpos: [7]; default: 0;
     *  1'b0:Global OUT NAK Effective Mask
     *  1'b1:No Global OUT NAK Effective Mask
     */
    uint32_t goutnackeffmsk: 1;
    uint32_t reserved_8: 2
    /** erlysuspmsk : R/W; bitpos: [10]; default: 0;
     *  1'b0:Early Suspend Mask
     *  1'b1:No Early Suspend Mask
     */
    uint32_t erlysuspmsk: 1;
    /** usbsuspmsk : R/W; bitpos: [11]; default: 0;
     *  1'b0:USB Suspend Mask
     *  1'b1:No USB Suspend Mask
     */
    uint32_t usbsuspmsk: 1;
    /** usbrstmsk : R/W; bitpos: [12]; default: 0;
     *  1'b0:USB Reset Mask
     *  1'b1:No USB Reset Mask
     */
    uint32_t usbrstmsk: 1;
    /** enumdonemsk : R/W; bitpos: [13]; default: 0;
     *  1'b0: Enumeration Done Mask
     *  1'b1: No Enumeration Done Mask
     */
    uint32_t enumdonemsk: 1;
    /** isooutdropmsk : R/W; bitpos: [14]; default: 0;
     *  1'b0: Isochronous OUT Packet Dropped Interrupt Mask
     *  1'b1: No Isochronous OUT Packet Dropped Interrupt Mask
     */
    uint32_t isooutdropmsk: 1;
    /** eopfmsk : R/W; bitpos: [15]; default: 0;
     *  1'b0: End of Periodic Frame Interrupt Mask
     *  1'b1: No End of Periodic Frame Interrupt Mask
     */
    uint32_t eopfmsk: 1;
    uint32_t reserved_16: 1
    /** epmismsk : R/W; bitpos: [17]; default: 0;
     *  1'b0: Endpoint Mismatch Interrupt Mask
     *  1'b1: No Endpoint Mismatch Interrupt Mask
     */
    uint32_t epmismsk: 1;
    /** iepintmsk : R/W; bitpos: [18]; default: 0;
     *  1'b0: IN Endpoints Interrupt Mask
     *  1'b1: No IN Endpoints Interrupt Mask
     */
    uint32_t iepintmsk: 1;
    /** oepintmsk : R/W; bitpos: [19]; default: 0;
     *  1'b0: OUT Endpoints Interrupt Mask
     *  1'b1: No OUT Endpoints Interrupt Mask
     */
    uint32_t oepintmsk: 1;
    /** incompisoinmsk : R/W; bitpos: [20]; default: 0;
     *  1'b0: Incomplete Isochronous IN Transfer Mask
     *  1'b1: No Incomplete Isochronous IN Transfer Mask
     */
    uint32_t incompisoinmsk: 1;
    /** incompipmsk : R/W; bitpos: [21]; default: 0;
     *  1'b0: Host mode: Incomplete Periodic Transfer Mask Device mode: Incomplete
     *  Isochronous OUT Transfer Mask
     *  1'b1: Host mode: No Incomplete Periodic Transfer Mask  Device mode: No Incomplete
     *  Isochronous OUT Transfer Mask
     */
    uint32_t incompipmsk: 1;
    /** fetsuspmsk : R/W; bitpos: [22]; default: 0;
     *  1'b0: Data Fetch Suspended Mask
     *  1'b1: No Data Fetch Suspended Mask
     */
    uint32_t fetsuspmsk: 1;
    /** resetdetmsk : R/W; bitpos: [23]; default: 0;
     *  1'b0: Reset detected Interrupt Mask
     *  1'b1: No Reset detected Interrupt Mask
     */
    uint32_t resetdetmsk: 1;
    /** prtlntmsk : R/W; bitpos: [24]; default: 0;
     *  1'b0: Host Port Interrupt Mask
     *  1'b1: No Host Port Interrupt Mask
     */
    uint32_t prtlntmsk: 1;
    /** hchintmsk : R/W; bitpos: [25]; default: 0;
     *  1'b0: Host Channels Interrupt Mask
     *  1'b1: No Host Channels Interrupt Mask
     */
    uint32_t hchintmsk: 1;
    /** ptxfempmsk : R/W; bitpos: [26]; default: 0;
     *  1'b0: Periodic TxFIFO Empty Mask
     *  1'b1: No Periodic TxFIFO Empty Mask
     */
    uint32_t ptxfempmsk: 1;
    uint32_t reserved_27: 1
    /** conidstschngmsk : R/W; bitpos: [28]; default: 0;
     *  1'b0: Connector ID Status Change Mask
     *  1'b1: No Connector ID Status Change Mask
     */
    uint32_t conidstschngmsk: 1;
    /** disconnintmsk : R/W; bitpos: [29]; default: 0;
     *  1'b0: Disconnect Detected Interrupt Mask
     *  1'b1: No Disconnect Detected Interrupt Mask
     */
    uint32_t disconnintmsk: 1;
    /** sessreqintmsk : R/W; bitpos: [30]; default: 0;
     *  1'b0: Session Request or New Session Detected Interrupt Mask
     *  1'b1: No Session Request or New Session Detected Interrupt Mask
     */
    uint32_t sessreqintmsk: 1;
    /** wkupintmsk : R/W; bitpos: [31]; default: 0;
     *  1'b0 : Resume or Remote Wakeup Detected Interrupt Mask
     *  1'b1 : Unmask Resume Remote Wakeup Detected Interrupt
     */
    uint32_t wkupintmsk: 1;


} usb_gintmsk_reg_t;

/** Type of haint register
 *  Host All Channels Interrupt Register
 */
typedef volatile struct {
    /** haint : RO; bitpos: [8:0]; default: 0;
     *  Channel Interrupt for channel no.
     */
    uint32_t haint: 8;


} usb_haint_reg_t;

/** Type of haintmsk register
 *  Host All Channels Interrupt Mask Register
 */
typedef volatile struct {
    /** haintmsk : R/W; bitpos: [8:0]; default: 0;
     *  Channel Interrupt Mask (HAINTMSK_REG) One bit per channel: Bit 0 for channel 0, bit
     *  15 for channel 15.
     */
    uint32_t haintmsk: 8;


} usb_haintmsk_reg_t;

/** Type of hcintn register
 *  Host Channel n Interrupt Register
 */
typedef volatile struct {
    /** h_xfercompln : R/W1C; bitpos: [0]; default: 0;
     *  1'b0: Transfer in progress or No Active Transfer
     *  1'b1: Transfer completed normally without any errors
     */
    uint32_t h_xfercompln: 1;
    /** h_chhltdn : R/W1C; bitpos: [1]; default: 0;
     *  1'b0: Channel not halted
     *  1'b1: Channel Halted
     */
    uint32_t h_chhltdn: 1;
    /** h_ahberrn : R/W1C; bitpos: [2]; default: 0;
     *  1'b0: No AHB error
     *  1'b1: AHB error during AHB read/write
     */
    uint32_t h_ahberrn: 1;
    /** h_stalln : R/W1C; bitpos: [3]; default: 0;
     *  1'b0: No Stall Response Received Interrupt
     *  1'b1: Stall Response Received Interrupt
     */
    uint32_t h_stalln: 1;
    /** h_nackn : R/W1C; bitpos: [4]; default: 0;
     *  1'b0: No NAK Response Received Interrupt
     *  1'b1: NAK Response Received Interrupt
     */
    uint32_t h_nackn: 1;
    /** h_ackn : R/W1C; bitpos: [5]; default: 0;
     *  1'b0: No ACK Response Received or Transmitted Interrupt
     *  1'b1: ACK Response Received or Transmitted Interrup
     */
    uint32_t h_ackn: 1;
    /** h_nyetn : R/W1C; bitpos: [6]; default: 0;
     *  1'b0: No NYET Response Received Interrupt
     *  1'b1: NYET Response Received Interrupt
     */
    uint32_t h_nyetn: 1;
    /** h_xacterrn : R/W1C; bitpos: [7]; default: 0;
     *  Indicates one of the following errors occurred on the USB:
     *  CRC check failure
     *  Timeout
     *  Bit stuff error
     *  False EOP
     */
    uint32_t h_xacterrn: 1;
    /** h_bblerrn : R/W1C; bitpos: [8]; default: 0;
     *  1'b0: No Babble Error
     *  1'b1: Babble Error
     */
    uint32_t h_bblerrn: 1;
    /** h_frmovrunn : R/W1C; bitpos: [9]; default: 0;
     *  1'b0: No Frame Overrun
     *  1'b1: Frame Overrun
     */
    uint32_t h_frmovrunn: 1;
    /** h_datatglerrn : R/W1C; bitpos: [10]; default: 0;
     *  1'b0: No Data Toggle Error
     *  1'b1: Data Toggle Error
     */
    uint32_t h_datatglerrn: 1;
    /** h_bnaintrn : R/W1C; bitpos: [11]; default: 0;
     *  1'b0: No BNA Interrupt
     *  1'b1: BNA Interrupt
     */
    uint32_t h_bnaintrn: 1;
    /** h_xcs_xact_errn : R/W1C; bitpos: [12]; default: 0;
     *  1'b0: No Excessive Transaction Error
     *  1'b1: Excessive Transaction Error
     */
    uint32_t h_xcs_xact_errn: 1;
    /** h_desc_lst_rollintrn : R/W1C; bitpos: [13]; default: 0;
     *  1'b0: No Descriptor rollover interrupt
     *  1'b1: Descriptor rollover interrupt
     */
    uint32_t h_desc_lst_rollintrn: 1;


} usb_hcintn_reg_t;

/** Type of hcintmskn register
 *  Host Channel n Interrupt Mask Register
 */
typedef volatile struct {
    /** h_xfercomplmskn : R/W; bitpos: [0]; default: 0;
     *  1'b0: Transfer Completed Mask
     *  1'b1: No Transfer Completed Mask
     */
    uint32_t h_xfercomplmskn: 1;
    /** h_chhltdmskn : R/W; bitpos: [1]; default: 0;
     *  1'b0: Channel Halted Mask
     *  1'b1: No Channel Halted Mask
     */
    uint32_t h_chhltdmskn: 1;
    /** h_ahberrmskn : R/W; bitpos: [2]; default: 0;
     *  1'b0: AHB Error Mask
     *  1'b1: No AHB Error Mask
     */
    uint32_t h_ahberrmskn: 1;
    /** h_stallmskn : R/W; bitpos: [3]; default: 0;
     *  1'b0: Mask STALL Response Received Interrupt
     *  1'b1: No STALL Response Received Interrupt Mask
     */
    uint32_t h_stallmskn: 1;
    /** h_nakmskn : R/W; bitpos: [4]; default: 0;
     *  1'b0: Mask NAK Response Received Interrupt
     *  1'b1: No NAK Response Received Interrupt Mask
     */
    uint32_t h_nakmskn: 1;
    /** h_ackmskn : R/W; bitpos: [5]; default: 0;
     *  1'b0: Mask ACK Response Received/Transmitted Interrupt
     *  1'b1: No ACK Response Received/Transmitted Interrupt Mask
     */
    uint32_t h_ackmskn: 1;
    /** h_nyetmskn : R/W; bitpos: [6]; default: 0;
     *  1'b0: Mask NYET Response Received Interrupt
     *  1'b1: No NYET Response Received Interrupt Mask
     */
    uint32_t h_nyetmskn: 1;
    /** h_xacterrmskn : R/W; bitpos: [7]; default: 0;
     *  1'b0: Mask Transaction Error
     *  1'b1: No Transaction Error Mask
     */
    uint32_t h_xacterrmskn: 1;
    /** h_bblerrmskn : R/W; bitpos: [8]; default: 0;
     *  Babble Error Mask
     *  1'b0: Mask Babble Error
     *  1'b1: No Babble Error Mask
     */
    uint32_t h_bblerrmskn: 1;
    /** h_frmovrunmskn : R/W; bitpos: [9]; default: 0;
     *  Frame Overrun Mask
     *  0x0 (MASK): Mask Overrun Mask
     *  0x1 (NOMASK): No Frame Overrun Mask
     */
    uint32_t h_frmovrunmskn: 1;
    /** h_datatglerrmskn : R/W; bitpos: [10]; default: 0;
     *  Data Toggle Error Mask n scatter/gather DMA mode for host
     *  1'b0: Mask Data Toggle Error
     *  1'b1: No Data Toggle Error Mask
     */
    uint32_t h_datatglerrmskn: 1;
    /** h_bnaintrmskn : R/W; bitpos: [11]; default: 0;
     *  BNA (Buffer Not Available) Interrupt mask register
     *  1'b0: BNA Interrupt Masked
     *  1'b1: BNA Interrupt not masked
     */
    uint32_t h_bnaintrmskn: 1;
    uint32_t reserved_12: 1
    /** h_desc_lst_rollintrmskn : R/W; bitpos: [13]; default: 0;
     *  Descriptor List rollover interrupt Mask
     *  1'b0: Descriptor Rollover Interrupt Mask
     *  1'b1: Descriptor Rollover Interrupt not masked
     */
    uint32_t h_desc_lst_rollintrmskn: 1;


