espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
} usb_hcintmskn_reg_t;

/** Type of diepmsk register
 *  Device IN Endpoint Common Interrupt Mask Register
 */
typedef volatile struct {
    /** di_xfercomplmsk : R/W; bitpos: [0]; default: 0;
     *  0x0 : Mask Transfer Completed Interrupt
     *  0x1 : No Transfer Completed Interrupt Mask
     */
    uint32_t di_xfercomplmsk: 1;
    /** di_epdisbldmsk : R/W; bitpos: [1]; default: 0;
     *  0x0 : Mask Endpoint Disabled Interrupt
     *  0x1 : No Endpoint Disabled Interrupt Mask
     */
    uint32_t di_epdisbldmsk: 1;
    /** di_ahbermsk : R/W; bitpos: [2]; default: 0;
     *  0x0 : Mask AHB Error Interrupt
     *  0x1 : No AHB Error Interrupt Mask
     */
    uint32_t di_ahbermsk: 1;
    /** timeoutmsk : R/W; bitpos: [3]; default: 0;
     *  0x0 : Mask Timeout Condition Interrupt
     *  0x1 : No Timeout Condition Interrupt Mask
     */
    uint32_t timeoutmsk: 1;
    /** intkntxfempmsk : R/W; bitpos: [4]; default: 0;
     *  0x0 : Mask IN Token Received When TxFIFO Empty Interrupt
     *  0x1 : No IN Token Received When TxFIFO Empty Interrupt
     */
    uint32_t intkntxfempmsk: 1;
    /** intknepmismsk : R/W; bitpos: [5]; default: 0;
     *  0x0 : Mask IN Token received with EP Mismatch Interrupt
     *  0x1 : No Mask IN Token received with EP Mismatch Interrupt
     */
    uint32_t intknepmismsk: 1;
    /** inepnakeffmsk : R/W; bitpos: [6]; default: 0;
     *  0x0 : Mask IN Endpoint NAK Effective Interrupt
     *  0x1 : No IN Endpoint NAK Effective Interrupt Mask
     */
    uint32_t inepnakeffmsk: 1;
    uint32_t reserved_7: 1
    /** txfifoundrnmsk : R/W; bitpos: [8]; default: 0;
     *  0x0 : Mask Fifo Underrun Interrupt
     *  0x1 : No Fifo Underrun Interrupt Mask
     */
    uint32_t txfifoundrnmsk: 1;
    /** bnainintrmsk : R/W; bitpos: [9]; default: 0;
     *  0x0 : Mask BNA Interrupt
     *  0x1 : No BNA Interrupt Mask
     */
    uint32_t bnainintrmsk: 1;
    uint32_t reserved_10: 3
    /** di_nakmsk : R/W; bitpos: [13]; default: 0;
     *  0x0 : Mask NAK Interrupt
     *  0x1 : No Mask NAK Interrupt
     */
    uint32_t di_nakmsk: 1;


} usb_diepmsk_reg_t;

/** Type of doepmsk register
 *  Device OUT Endpoint Common Interrupt Mask Register
 */
typedef volatile struct {
    /** xfercomplmsk : R/W; bitpos: [0]; default: 0;
     *  0x0 : Mask Transfer Completed Interrupt
     *  0x1 : No Transfer Completed Interrupt Mask
     */
    uint32_t xfercomplmsk: 1;
    /** epdisbldmsk : R/W; bitpos: [1]; default: 0;
     *  0x0 : Mask Endpoint Disabled Interrupt
     *  0x1 : No Endpoint Disabled Interrupt Mask
     */
    uint32_t epdisbldmsk: 1;
    /** ahbermsk : R/W; bitpos: [2]; default: 0;
     *  0x0 : Mask AHB Error Interrupt
     *  0x1 : No AHB Error Interrupt Mask
     */
    uint32_t ahbermsk: 1;
    /** setupmsk : R/W; bitpos: [3]; default: 0;
     *  0x0 : Mask SETUP Phase Done Interrupt
     *  0x1 : No SETUP Phase Done Interrupt Mask
     */
    uint32_t setupmsk: 1;
    /** outtknepdismsk : R/W; bitpos: [4]; default: 0;
     *  0x0 : Mask OUT Token Received when Endpoint Disabled Interrupt
     *  0x1 : No OUT Token Received when Endpoint Disabled Interrupt Mask
     */
    uint32_t outtknepdismsk: 1;
    /** stsphsercvdmsk : R/W; bitpos: [5]; default: 0;
     *  0x0 : Status Phase Received Mask
     *  0x1 : No Status Phase Received Mask
     */
    uint32_t stsphsercvdmsk: 1;
    /** back2backsetup : R/W; bitpos: [6]; default: 0;
     *  0x0 : Mask Back-to-Back SETUP Packets Received Interrupt
     *  0x1 : No Back-to-Back SETUP Packets Received Interrupt Mask
     */
    uint32_t back2backsetup: 1;
    uint32_t reserved_7: 1
    /** outpkterrmsk : R/W; bitpos: [8]; default: 0;
     *  0x0 : Mask OUT Packet Error Interrupt
     *  0x1 : No OUT Packet Error Interrupt Mask
     */
    uint32_t outpkterrmsk: 1;
    /** bnaoutintrmsk : R/W; bitpos: [9]; default: 0;
     *  0x0 : Mask BNA Interrupt
     *  0x1 : No BNA Interrupt Mask
     */
    uint32_t bnaoutintrmsk: 1;
    uint32_t reserved_10: 2
    /** bbleerrmsk : R/W; bitpos: [12]; default: 0;
     *  0x0 : Mask Babble Error Interrupt
     *  0x1 : No Babble Error Interrupt Mask
     */
    uint32_t bbleerrmsk: 1;
    /** nakmsk : R/W; bitpos: [13]; default: 0;
     *  0x0 : Mask NAK Interrupt
     *  0x1 : No NAK Interrupt Mask
     */
    uint32_t nakmsk: 1;
    /** nyetmsk : R/W; bitpos: [14]; default: 0;
     *  NYET interrupt Mask
     *  0x0 : Mask NYET Interrupt
     *  0x1 : No NYET Interrupt Mask
     */
    uint32_t nyetmsk: 1;


} usb_doepmsk_reg_t;

/** Type of daint register
 *  Device All Endpoints Interrupt Register
 */
typedef volatile struct {
    /** inepint0 : RO; bitpos: [0]; default: 0;
     *  IN Endpoint 0 Interrupt Bit.
     */
    uint32_t inepint0: 1;
    /** inepint1 : RO; bitpos: [1]; default: 0;
     *  IN Endpoint 1 Interrupt Bit.
     */
    uint32_t inepint1: 1;
    /** inepint2 : RO; bitpos: [2]; default: 0;
     *  IN Endpoint 2 Interrupt Bit.
     */
    uint32_t inepint2: 1;
    /** inepint3 : RO; bitpos: [3]; default: 0;
     *  IN Endpoint 3 Interrupt Bit.
     */
    uint32_t inepint3: 1;
    /** inepint4 : RO; bitpos: [4]; default: 0;
     *  IN Endpoint 4 Interrupt Bit.
     */
    uint32_t inepint4: 1;
    /** inepint5 : RO; bitpos: [5]; default: 0;
     *  IN Endpoint 5 Interrupt Bit.
     */
    uint32_t inepint5: 1;
    /** inepint6 : RO; bitpos: [6]; default: 0;
     *  IN Endpoint 6 Interrupt Bit.
     */
    uint32_t inepint6: 1;
    uint32_t reserved_7: 9
    /** outepint0 : RO; bitpos: [16]; default: 0;
     *  OUT Endpoint 0 Interrupt Bit.
     */
    uint32_t outepint0: 1;
    /** outepint1 : RO; bitpos: [17]; default: 0;
     *  OUT Endpoint 1 Interrupt Bit.
     */
    uint32_t outepint1: 1;
    /** outepint2 : RO; bitpos: [18]; default: 0;
     *  OUT Endpoint 2 Interrupt Bit.
     */
    uint32_t outepint2: 1;
    /** outepint3 : RO; bitpos: [19]; default: 0;
     *  OUT Endpoint 3 Interrupt Bit.
     */
    uint32_t outepint3: 1;
    /** outepint4 : RO; bitpos: [20]; default: 0;
     *  OUT Endpoint 4 Interrupt Bit.
     */
    uint32_t outepint4: 1;
    /** outepint5 : RO; bitpos: [21]; default: 0;
     *  OUT Endpoint 5 Interrupt Bit.
     */
    uint32_t outepint5: 1;
    /** outepint6 : RO; bitpos: [22]; default: 0;
     *  OUT Endpoint 6 Interrupt Bit.
     */
    uint32_t outepint6: 1;


} usb_daint_reg_t;

/** Type of daintmsk register
 *  Device All Endpoints Interrupt Mask Register
 */
typedef volatile struct {
    /** inepmsk0 : R/W; bitpos: [0]; default: 0;
     *  IN Endpoint 0 Interrupt mask Bit.
     */
    uint32_t inepmsk0: 1;
    /** inepmsk1 : R/W; bitpos: [1]; default: 0;
     *  IN Endpoint 1 Interrupt mask Bit.
     */
    uint32_t inepmsk1: 1;
    /** inepmsk2 : R/W; bitpos: [2]; default: 0;
     *  IN Endpoint 2 Interrupt mask Bit.
     */
    uint32_t inepmsk2: 1;
    /** inepmsk3 : R/W; bitpos: [3]; default: 0;
     *  IN Endpoint 3 Interrupt mask Bit.
     */
    uint32_t inepmsk3: 1;
    /** inepmsk4 : R/W; bitpos: [4]; default: 0;
     *  IN Endpoint 4 Interrupt mask Bit.
     */
    uint32_t inepmsk4: 1;
    /** inepmsk5 : R/W; bitpos: [5]; default: 0;
     *  IN Endpoint 5 Interrupt mask Bit.
     */
    uint32_t inepmsk5: 1;
    /** inepmsk6 : R/W; bitpos: [6]; default: 0;
     *  IN Endpoint 6 Interrupt mask Bit.
     */
    uint32_t inepmsk6: 1;
    uint32_t reserved_7: 9
    /** outepmsk0 : R/W; bitpos: [16]; default: 0;
     *  OUT Endpoint 0 Interrupt mask Bit.
     */
    uint32_t outepmsk0: 1;
    /** outepmsk1 : R/W; bitpos: [17]; default: 0;
     *  OUT Endpoint 1 Interrupt mask Bit.
     */
    uint32_t outepmsk1: 1;
    /** outepmsk2 : R/W; bitpos: [18]; default: 0;
     *  OUT Endpoint 2 Interrupt mask Bit.
     */
    uint32_t outepmsk2: 1;
    /** outepmsk3 : R/W; bitpos: [19]; default: 0;
     *  OUT Endpoint 3 Interrupt mask Bit.
     */
    uint32_t outepmsk3: 1;
    /** outepmsk4 : R/W; bitpos: [20]; default: 0;
     *  OUT Endpoint 4 Interrupt mask Bit.
     */
    uint32_t outepmsk4: 1;
    /** outepmsk5 : R/W; bitpos: [21]; default: 0;
     *  OUT Endpoint 5 Interrupt mask Bit.
     */
    uint32_t outepmsk5: 1;
    /** outepmsk6 : R/W; bitpos: [22]; default: 0;
     *  OUT Endpoint 6 Interrupt mask Bit.
     */
    uint32_t outepmsk6: 1;


