espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
} usb_daintmsk_reg_t;

/** Type of diepempmsk register
 *  Device IN Endpoint FIFO Empty Interrupt Mask Register
 */
typedef volatile struct {
    /** d_ineptxfempmsk : R/W; bitpos: [16:0]; default: 0;
     *  IN EP Tx FIFO Empty Interrupt Mask Bits
     *  0x1 (EP0_MASK): Mask IN EP0 Tx FIFO Empty Interrupt
     *  0x2 (EP1_MASK): Mask IN EP1 Tx FIFO Empty Interrupt
     *  0x4 (EP2_MASK): Mask IN EP2 Tx FIFO Empty Interrupt
     *  0x8 (EP3_MASK): Mask IN EP3 Tx FIFO Empty Interrupt
     *  0x10 (EP4_MASK): Mask IN EP4 Tx FIFO Empty Interrupt
     *  0x20 (EP5_MASK): Mask IN EP5 Tx FIFO Empty Interrupt
     *  0x40 (EP6_MASK): Mask IN EP6 Tx FIFO Empty Interrupt
     *  0x80 (EP7_MASK): Mask IN EP7 Tx FIFO Empty Interrupt
     *  0x100 (EP8_MASK): Mask IN EP8 Tx FIFO Empty Interrupt
     *  0x200 (EP9_MASK): Mask IN EP9 Tx FIFO Empty Interrupt
     *  0x400 (EP10_MASK): Mask IN EP10 Tx FIFO Empty Interrupt
     *  0x800 (EP11_MASK): Mask IN EP11 Tx FIFO Empty Interrupt
     *  0x1000 (EP12_MASK): Mask IN EP12 Tx FIFO Empty Interrupt
     *  0x2000 (EP13_MASK): Mask IN EP13 Tx FIFO Empty Interrupt
     *  0x4000 (EP14_MASK): Mask IN EP14 Tx FIFO Empty Interrupt
     *  0x8000 (EP15_MASK): Mask IN EP15 Tx FIFO Empty Interrupt
     */
    uint32_t d_ineptxfempmsk: 16;


} usb_diepempmsk_reg_t;

/** Type of diepintn register
 *  Device IN Endpoint n Interrupt Register
 */
typedef volatile struct {
    /** d_xfercompln : R/W1C; bitpos: [0]; default: 0;
     *  0x0 : No Transfer Complete Interrupt
     *  0x1 : Transfer Completed Interrupt
     */
    uint32_t d_xfercompln: 1;
    /** d_epdisbldn : R/W1C; bitpos: [1]; default: 0;
     *  0x0 : No Endpoint Disabled Interrupt
     *  0x1 : Endpoint Disabled Interrupt
     */
    uint32_t d_epdisbldn: 1;
    /** d_ahberrn : R/W1C; bitpos: [2]; default: 0;
     *  0x0 : No AHB Error Interrupt
     *  0x1 : AHB Error interrupt
     */
    uint32_t d_ahberrn: 1;
    /** d_timeoutn : R/W1C; bitpos: [3]; default: 0;
     *  0x0 : No Timeout interrupt
     *  0x1 : Timeout interrupt
     */
    uint32_t d_timeoutn: 1;
    /** d_intkntxfempn : R/W1C; bitpos: [4]; default: 0;
     *  0x0 : No IN Token Received when TxFIFO Empty Interrupt
     *  0x1 : IN Token Received when TxFIFO Empty Interrupt
     */
    uint32_t d_intkntxfempn: 1;
    /** d_intknepmisn : R/W1C; bitpos: [5]; default: 0;
     *  0x0 : No IN Token Received with EP Mismatch Interrupt
     *  0x1 : IN Token Received with EP Mismatch interrupt
     */
    uint32_t d_intknepmisn: 1;
    /** d_inepnakeffn : R/W1C; bitpos: [6]; default: 0;
     *  IN Endpoint NAK Effective
     *  0x0 : No IN Endpoint NAK Effective interrupt
     *  0x1 : IN Endpoint NAK Effective interrupt
     */
    uint32_t d_inepnakeffn: 1;
    /** d_txfempn : RO; bitpos: [7]; default: 0;
     *  This interrupt is asserted when the TxFIFO for this endpoint is either half or
     *  completely empty
     *  0x0 : No Transmit FIFO Empty interrupt
     *  0x1 : Transmit FIFO Empty interrupt
     */
    uint32_t d_txfempn: 1;
    /** d_txfifoundrnn : R/W1C; bitpos: [8]; default: 0;
     *  The core generates this interrupt when it detects a transmit FIFO underrun
     *  condition in threshold mode for this endpoint
     *  0x0 : No Fifo Underrun interrupt
     *  0x1 : Fifo Underrun interrupt
     */
    uint32_t d_txfifoundrnn: 1;
    /** d_bnaintrn : R/W1C; bitpos: [9]; default: 0;
     *  This bit is valid only when Scatter/Gather DMA mode is enabled. The core generates
     *  this interrupt when the descriptor accessed is not ready for the Core to process,
     *  such as Host busy or DMA done
     *  0x0 : No BNA interrupt
     *  0x1 : BNA interrupt
     */
    uint32_t d_bnaintrn: 1;
    uint32_t reserved_10: 1
    /** d_pktdrpstsn : R/W1C; bitpos: [11]; default: 0;
     *  Packet Drop Status. This bit indicates to the application that an ISOC OUT packet
     *  has been dropped. This bit does not have an associated mask bit and does not
     *  generate an interrupt
     *  0x0 : No interrupt
     *  0x1 : Packet Drop Status
     */
    uint32_t d_pktdrpstsn: 1;
    /** d_bbleerrn : R/W1C; bitpos: [12]; default: 0;
     *  The core generates this interrupt when babble is received for the endpoint
     *  0x0 : No interrupt
     *  0x1 : BbleErr interrupt
     */
    uint32_t d_bbleerrn: 1;
    /** d_nakintrptn : R/W1C; bitpos: [13]; default: 0;
     *  NAK Interrupt. The core generates this interrupt when a NAK is transmitted or
     *  received by the device
     *  0x0 : No interrupt
     *  0x1 : NAK Interrupt
     */
    uint32_t d_nakintrptn: 1;
    /** d_nyetintrptn : R/W1C; bitpos: [14]; default: 0;
     *  NYET Interrupt. The core generates this interrupt when a NYET response is
     *  transmitted for a non isochronous OUT endpoint
     *  0x0 : No interrupt
     *  0x1 : NYET Interrupt
     */
    uint32_t d_nyetintrptn: 1;


} usb_diepintn_reg_t;

/** Type of doepintn register
 *  Device OUT Endpoint n Interrupt Register
 */
typedef volatile struct {
    /** xfercompln : R/W1C; bitpos: [0]; default: 0;
     *  Transfer Completed Interrupt
     *  0x0 : No Transfer Complete Interrupt
     *  0x1 : Transfer Complete Interrupt
     */
    uint32_t xfercompln: 1;
    /** epdisbldn : R/W1C; bitpos: [1]; default: 0;
     *  Endpoint Disabled Interrupt
     *  0x0 : No Endpoint Disabled Interrupt
     *  0x1 : Endpoint Disabled Interrupt
     */
    uint32_t epdisbldn: 1;
    /** ahberrn : R/W1C; bitpos: [2]; default: 0;
     *  AHB Error
     *  0x0 : No AHB Error Interrupt
     *  0x1 : AHB Error interrupt
     */
    uint32_t ahberrn: 1;
    /** setupn : R/W1C; bitpos: [3]; default: 0;
     *  SETUP Phase Done
     *  0x0 : No SETUP Phase Done
     *  0x1 : SETUP Phase Done
     */
    uint32_t setupn: 1;
    /** outtknepdisn : R/W1C; bitpos: [4]; default: 0;
     *  OUT Token Received When Endpoint Disabled
     *  0x0 : No OUT Token Received When Endpoint Disabled
     *  0x1 : OUT Token Received When Endpoint Disabled
     */
    uint32_t outtknepdisn: 1;
    /** stsphsercvdn : R/W1C; bitpos: [5]; default: 0;
     *  Status Phase Received for Control Write
     *  0x0 : No Status Phase Received for Control Write
     *  0x1 : Status Phase Received for Control Write
     */
    uint32_t stsphsercvdn: 1;
    /** back2backsetupn : R/W1C; bitpos: [6]; default: 0;
     *  Back-to-Back SETUP Packets Received
     *  0x0 : No Back-to-Back SETUP Packets Received
     *  0x1 : Back-to-Back SETUP Packets Received
     */
    uint32_t back2backsetupn: 1;
    uint32_t reserved_7: 1
    /** outpkterrn : R/W1C; bitpos: [8]; default: 0;
     *  OUT Packet Error
     *  0x0 : No OUT Packet Error
     *  0x1 : OUT Packet Error
     */
    uint32_t outpkterrn: 1;
    /** bnaintrn : R/W1C; bitpos: [9]; default: 0;
     *  Buffer Not Available Interrupt
     *  0x0 : No BNA interrupt
     *  0x1 : BNA interrupt
     */
    uint32_t bnaintrn: 1;
    uint32_t reserved_10: 1
    /** pktdrpstsn : R/W1C; bitpos: [11]; default: 0;
     *  0x0 : No interrupt
     *  0x1 : Packet Drop Status interrupt
     */
    uint32_t pktdrpstsn: 1;
    /** bbleerrn : R/W1C; bitpos: [12]; default: 0;
     *  0x0 : No BbleErr interrupt
     *  0x1 : BbleErr interrupt
     */
    uint32_t bbleerrn: 1;
    /** nakintrptn : R/W1C; bitpos: [13]; default: 0;
     *  0x0 : No NAK interrupt
     *  0x1 : NAK Interrupt
     */
    uint32_t nakintrptn: 1;
    /** nyepintrptn : R/W1C; bitpos: [14]; default: 0;
     *  0x0 : No NYET interrupt
     *  0x1 : NYET Interrupt
     */
    uint32_t nyepintrptn: 1;
    /** stuppktrcvdn : R/W1C; bitpos: [15]; default: 0;
     *  0x0 : No Setup packet received
     *  0x1 : Setup packet received
     */
    uint32_t stuppktrcvdn: 1;


} usb_doepintn_reg_t;



