espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
/** configuration registers */
/** Type of gahbcfg register
 *  AHB Configuration Register
 */
typedef volatile struct {
    /** glbllntrmsk : R/W; bitpos: [0]; default: 0;
     *  1'b0: Mask the interrupt assertion to the application.
     *  1'b1: Unmask the interrupt assertion to the application
     */
    uint32_t glbllntrmsk: 1;
    /** hbstlen : R/W; bitpos: [5:1]; default: 0;
     *  this field is used in Internal DMA modes
     *  4'b0000 Single
     *  4'b0001: INCR
     *  4'b0011 INCR4
     *  4'b0101 INCR8
     *  4'b0111 INCR16
     *  Others: Reserved
     */
    uint32_t hbstlen: 4;
    /** dmaen : R/W; bitpos: [5]; default: 0;
     *  This bit is always 0 when Slave-Only mode has been selected
     *  1'b0:Core operates in Slave mode
     *  1'b1:Core operates in a DMA mode
     */
    uint32_t dmaen: 1;
    uint32_t reserved_6: 1
    /** nptxfemplvl : R/W; bitpos: [7]; default: 0;
     *  Non-Periodic TxFIFO Empty Level
     *  1'b0: DIEPINTn_REG.REG_TXFEMP interrupt indicates that the Non-Periodic TxFIFO is
     *  half empty or that the IN Endpoint TxFIFO is half empty
     *  1'b1: GINTSTS_REG.USB_NPTXFEMP interrupt indicates that the Non-Periodic TxFIFO is
     *  completely empty or that the IN Endpoint TxFIFO is completely empty
     */
    uint32_t nptxfemplvl: 1;
    /** ptxfemplvl : R/W; bitpos: [8]; default: 0;
     *  Indicates when the Periodic TxFIFO Empty Interrupt bit in the Core Interrupt
     *  register (GINTSTS_REG.USB_PTXFEMP) is triggered. This bit is used only in Slave
     *  mode
     *  1'b0: GINTSTS_REG.USB_PTXFEMP interrupt indicates that the Periodic TxFIFO is half
     *  empty
     *  1'b1: GINTSTS_REG.USB_PTXFEMP interrupt indicates that the Periodic TxFIFO is
     *  completely empty
     */
    uint32_t ptxfemplvl: 1;
    uint32_t reserved_9: 12
    /** remmemsupp : R/W; bitpos: [21]; default: 0;
     *  Remote Memory Support (RemMemSupp) This bit is programmed to enable the
     *  functionality to wait for thesystem DMA Done Signal for the DMA Write Transfers
     *  1'b0:Remote Memory Support Feature disabled
     *  1'b1:Remote Memory Support Feature enabled
     */
    uint32_t remmemsupp: 1;
    /** notialldmawrit : R/W; bitpos: [22]; default: 0;
     *  Notify All DMA Write Transactions (NotiAllDmaWrit) This bit is programmed to enable
     *  the System DMA Done functionality for all the DMA write Transactions corresponding
     *  to the Channel/Endpoint. This bit is valid only when GAHBCFG.RemMemSupp is set to 1
     */
    uint32_t notialldmawrit: 1;
    /** ahbsingle : R/W; bitpos: [23]; default: 0;
     *  AHB Single Support (AHBSingle) This bit when programmed supports Single transfers
     *  for the remaining data in a transfer when the core is operating in DMA mode
     *  1'b0: The remaining data in the transfer is sent using INCR burst size
     *  1'b1: The remaining data in the transfer is sent using Single burst size
     */
    uint32_t ahbsingle: 1;
    /** invdescendianess : R/W; bitpos: [24]; default: 0;
     *  Invert Descriptor Endianess
     *  1'b0: Descriptor Endianness is same as AHB Master Endianness
     *  1'b1:Invert Descriptor Endianess according to AHB Master endianness
     */
    uint32_t invdescendianess: 1;


} usb_gahbcfg_reg_t;

/** Type of gusbcfg register
 *  USB Configuration Register
 */
typedef volatile struct {
    /** toutcal : R/W; bitpos: [3:0]; default: 0;
     *  FS Timeout Calibration
     */
    uint32_t toutcal: 3;
    /** phyif : R/W; bitpos: [3]; default: 0;
     *  The application uses this bit to configure the core to support a
     *  UTMI+ PHY with an 8- or 16-bit interface. When a ULPI PHY is
     *  chosen, this must be Set to 8-bit mode
     *  1'b0: 8 bits
     *  1'b1: 16 bits
     */
    uint32_t phyif: 1;
    /** ulpi_utmi_sel : RO; bitpos: [4]; default: 0;
     *  1'b0: UTMI+ Interface
     *  1'b1: ULPI Interface
     */
    uint32_t ulpi_utmi_sel: 1;
    /** fsintf : R/W; bitpos: [5]; default: 0;
     *  1'b0: 6-pin unidirectional full-speed serial interface
     *  1'b1: 3-pin bidirectional full-speed serial interface
     */
    uint32_t fsintf: 1;
    /** physel : RO; bitpos: [6]; default: 1;
     *  1'b0: USB 2.0 high-speed UTMI+ or ULPI PHY
     *  1'b1: USB 1.1 full-speed serial transceiver
     */
    uint32_t physel: 1;
    uint32_t reserved_7: 1
    /** srpcap : R/W; bitpos: [8]; default: 0;
     *  1'b0: SRP capability is not enabled
     *  1'b1: SRP capability is enabled
     */
    uint32_t srpcap: 1;
    /** hnpcap : R/W; bitpos: [9]; default: 0;
     *  1'b0: HNP capability is not enabled
     *  1'b1: HNP capability is enabled
     */
    uint32_t hnpcap: 1;
    /** usbtrdtim : R/W; bitpos: [14:10]; default: 5;
     *  4'h5: When the MAC interface is 16-bit UTMI+
     *  4'h9: When the MAC interface is 8-bit UTMI+
     */
    uint32_t usbtrdtim: 4;
    uint32_t reserved_14: 8
    /** termseldlpulse : R/W; bitpos: [22]; default: 0;
     *  TermSel DLine Pulsing Selection
     *  1'b0: Data line pulsing using utmi_txvalid (Default)
     *  1'b1: Data line pulsing using utmi_termsel
     */
    uint32_t termseldlpulse: 1;
    uint32_t reserved_23: 5
    /** txenddelay : R/W; bitpos: [28]; default: 0;
     *  1'b0 : Normal Mode
     *  1'b1 : Tx End delay
     */
    uint32_t txenddelay: 1;
    /** forcehstmode : R/W; bitpos: [29]; default: 0;
     *  1'b0 : Normal Mode
     *  1'b1 : Force Host Mode
     */
    uint32_t forcehstmode: 1;
    /** forcedevmode : R/W; bitpos: [30]; default: 0;
     *  1'b0 : Normal Mode
     *  1'b1 : Force Device Mode
     */
    uint32_t forcedevmode: 1;
    /** corrupttxpkt : R/W; bitpos: [31]; default: 0;
     *  This bit is for debug purposes only. Never Set this bit to 1. The application
     *  should always write 1'b0 to this bit
     *  1'b0:Normal Mode
     *  1'b1:Debug Mode
     */
    uint32_t corrupttxpkt: 1;


} usb_gusbcfg_reg_t;

/** Type of grstctl register
 *  Reset Register
 */
typedef volatile struct {
    /** csftrst : R_WS_SC; bitpos: [0]; default: 0;
     *  Core Soft Reset
     */
    uint32_t csftrst: 1;
    /** piufssftrst : R_WS_SC; bitpos: [1]; default: 0;
     *  1'b0: No Reset
     *  1'b1:PIU FS Dedicated Controller Soft Reset
     */
    uint32_t piufssftrst: 1;
    /** frmcntrrst : R/W1S; bitpos: [2]; default: 0;
     *  Host only. Host Frame Counter Reset.The application writes this bit to reset the
     *  (micro)Frame number counter inside the core. When the (micro)Frame counter is
     *  reset, the subsequent SOF sent out by the core has a (micro)Frame number of 0
     */
    uint32_t frmcntrrst: 1;
    uint32_t reserved_3: 1
    /** rxfflsh : R/W1S; bitpos: [4]; default: 0;
     *  RxFIFO Flush. The application can flush the entire RxFIFO using this bit, but must
     *  first ensure that the core is not in the middle of a transaction.The application
     *  must only write to this bit after checking that the controller is neither reading
     *  from the RxFIFO nor writing to the RxFIFO
     *  1'b0:Does not flush the entire RxFIFO
     *  1'b1:flushes the entire RxFIFO
     */
    uint32_t rxfflsh: 1;
    /** txfflsh : R/W1S; bitpos: [5]; default: 0;
     *  TxFIFO Flush.This bit selectively flushes a single or all transmit FIFOs, but
     *  cannot do so If the core is in the midst of a transaction.The application must
     *  write this bit only after checking that the core is neither writing to the TxFIFO
     *  nor reading from the TxFIFO.
     */
    uint32_t txfflsh: 1;
    /** txfnum : R/W; bitpos: [11:6]; default: 0;
     *  TxFIFO Number.This is the FIFO number that must be flushed using the TxFIFO Flush
     *  bit. This field must not be changed until the core clears the TxFIFO Flush bit
     */
    uint32_t txfnum: 5;
    uint32_t reserved_11: 19
    /** dmareq : RO; bitpos: [30]; default: 0;
     *  DMA Request Signal
     *  1'b0:No DMA request
     *  1'b1:DMA request is in progress
     */
    uint32_t dmareq: 1;
    /** ahbidle : RO; bitpos: [31]; default: 0;
     *  AHB Master Idle
     *  1'b0:Not Idle
     *  1'b1:AHB Master Idle
     */
    uint32_t ahbidle: 1;


} usb_grstctl_reg_t;

/** Type of grxfsiz register
 *  Receive FIFO Size Register
 */
typedef volatile struct {
    /** rxfdep : R/W; bitpos: [16:0]; default: 256;
     *  RxFIFO Depth.This value is in terms of 32-bit words.Minimum value is 16,Maximum
     *  value is 32,768
     */
    uint32_t rxfdep: 16;


