espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
} usb_grxfsiz_reg_t;

/** Type of gnptxfsiz register
 *  Non-periodic Transmit FIFO Size Register
 */
typedef volatile struct {
    /** nptxfstaddr : R/W; bitpos: [16:0]; default: 256;
     *  The NPTxFStAddr field description is valid only for host mode.This field contains
     *  the memory start address for Non-periodic Transmit FIFO RAM.
     */
    uint32_t nptxfstaddr: 16;
    /** nptxfdep : R/W; bitpos: [32:16]; default: 256;
     *  The NPTxFDep field description is valid only for host mode or device mode when
     *  OTG_EN_DED_TX_FIFO=0.Minimum value is 16,Maximum value is 32,768.
     */
    uint32_t nptxfdep: 16;


} usb_gnptxfsiz_reg_t;

/** Type of gnptxsts register
 *  Non-periodic Transmit FIFO/Queue Status Register
 */
typedef volatile struct {
    /** nptxfspcavail : RO; bitpos: [16:0]; default: 256;
     *  Non-periodic TxFIFO Space Avail.Indicates the amount of free space available in the
     *  Non-periodic TxFIFO.Values are in terms of 32-bit words.
     */
    uint32_t nptxfspcavail: 16;
    /** nptxqspcavail : RO; bitpos: [20:16]; default: 4;
     *  Non-periodic Transmit Request Queue Space Available.Indicates the amount of free
     *  space available in the Non-periodic Transmit Request Queue. This queue holds both
     *  IN and OUT requests in Host mode. Device mode has only IN requests.
     */
    uint32_t nptxqspcavail: 4;
    uint32_t reserved_20: 4
    /** nptxqtop : RO; bitpos: [31:24]; default: 0;
     *  Top of the Non-periodic Transmit Request Queue.
     *  Bits [30:27]: Channel/endpoint number.
     *  Bits [26:25]:  2'b00: IN/OUT token   2'b01: Zero-length transmit packet (device
     *  IN/host OUT)   2'b10: PING/CSPLIT token  2'b11: Channel halt command.
     *  Bit [24]: Terminate (last Entry for selected channel/endpoint).
     */
    uint32_t nptxqtop: 7;


} usb_gnptxsts_reg_t;

/** Type of hctsizn register
 *  Host Channel nTransfer Size Register
 */
typedef volatile struct {
    /** h_xfersizen : R/W; bitpos: [19:0]; default: 0;
     *  Non-Scatter/Gather DMA Mode: Transfer Size.
     *  Scatter/Gather DMA Mode:
     *  [18:16]: Reserved
     *  [15:8]: NTD (Number of Transfer Descriptors)
     */
    uint32_t h_xfersizen: 19;
    /** h_pktcntn : R/W; bitpos: [29:19]; default: 0;
     *  when in Non-Scatter/Gather DMA mode: Packet Count . This field is programmed by the
     *  application with the expected number of packets to be transmitted (OUT) or received
     *  (IN).
     *  Scatter/Gather DMA Mode: Reserved.
     */
    uint32_t h_pktcntn: 10;
    /** h_pidn : R/W; bitpos: [31:29]; default: 0;
     *  2'b00: DATA0
     *  2'b01: DATA2
     *  2'b10: DATA1
     *  2'b11: MDATA (non-control)/SETUP (control)
     */
    uint32_t h_pidn: 2;
    /** h_dopngn : R/W; bitpos: [31]; default: 0;
     *  This bit is used only for OUT transfers. Setting this field to 1 directs the host
     *  to do PING protocol
     *  1'b0: No ping protocol
     *  1'b1: Ping protocol
     */
    uint32_t h_dopngn: 1;


} usb_hctsizn_reg_t;



/** Status registers */
/** Type of grxstsr register
 *  Receive Status Debug Read Register
 */
typedef volatile struct {
    /** g_chnum : RO; bitpos: [4:0]; default: 0;
     *  Channel Number: Host only. Indicates the channel number to which the current
     *  received packet belongs.
     *  Endpoint Number: Device only Indicates the endpoint number to which the current
     *  received packet belongs
     */
    uint32_t g_chnum: 4;
    /** g_bcnt : RO; bitpos: [15:4]; default: 0;
     *  In host mode, indicates the byte count of the received IN data Packet
     *  In device mode, indicates the byte count of the received data packet
     */
    uint32_t g_bcnt: 11;
    /** g_dpid : RO; bitpos: [17:15]; default: 0;
     *  Data PID
     *  0x0 (DATA0): DATA0
     *  0x2 (DATA1): DATA1
     *  0x1 (DATA2): DATA2
     *  0x3 (MDATA): MDATA
     */
    uint32_t g_dpid: 2;
    /** g_pktsts : RO; bitpos: [21:17]; default: 0;
     *  0x1 (OUTNAK): Global OUT NAK in device mode (triggers an Interrupt)
     *  0x2 (INOUTDPRX): IN data packet received in host mode and  OUT data received in
     *  device mode
     *  0x3 (INOUTTRCOM): IN or OUT transfer completed in both host  and device (triggers
     *  an interrupt)
     *  0x4 (DSETUPCOM): SETUP transaction completed in device mode (triggers an interrupt)
     *  0x5 (DTTOG): Data toggle error (triggers an interrupt) in host Mode
     *  0x6 (DSETUPRX): SETUP data packet received in device mode
     *  0x7 (CHHALT): Channel halted in host mode (triggers an  interrupt)
     */
    uint32_t g_pktsts: 4;
    /** g_fn : RO; bitpos: [25:21]; default: 0;
     *  This is the least significant 4 bits of the (micro)Frame number in which the packet
     *  is received on the USB. This field is supported only when isochronous OUT endpoints
     *  are supported
     */
    uint32_t g_fn: 4;


} usb_grxstsr_reg_t;

/** Type of grxstsp register
 *  Receive Status Read/Pop Register
 */
typedef volatile struct {
    /** chnum : RO; bitpos: [4:0]; default: 0;
     *  Channel Number: Host only. Indicates the channel number to which the current
     *  received packet belongs.
     *  Endpoint Number: Device only Indicates the endpoint number to which the current
     *  received packet belongs
     */
    uint32_t chnum: 4;
    /** bcnt : RO; bitpos: [15:4]; default: 0;
     *  In host mode, indicates the byte count of the received IN data Packet
     *  In device mode, indicates the byte count of the received data packet
     */
    uint32_t bcnt: 11;
    /** dpid : RO; bitpos: [17:15]; default: 0;
     *  Data PID
     *  0x0 (DATA0): DATA0
     *  0x2 (DATA1): DATA1
     *  0x1 (DATA2): DATA2
     *  0x3 (MDATA): MDATA
     */
    uint32_t dpid: 2;
    /** pktsts : RO; bitpos: [21:17]; default: 0;
     *  0x1 (OUTNAK): Global OUT NAK in device mode (triggers an Interrupt)
     *  0x2 (INOUTDPRX): IN data packet received in host mode and  OUT data packet received
     *  in device mode
     *  0x3 (INOUTTRCOM): IN or OUT transfer completed in both host  and device mode
     *  (triggers an interrupt)
     *  0x4 (DSETUPCOM): SETUP transaction completed in device mode (triggers an interrupt)
     *  0x5 (DTTOG): Data toggle error (triggers an interrupt) in host Mode
     *  0x6 (DSETUPRX): SETUP data packet received in device mode
     *  0x7 (CHHALT): Channel halted in host mode (triggers an  interrupt)
     */
    uint32_t pktsts: 4;
    /** fn : RO; bitpos: [25:21]; default: 0;
     *  This is the least significant 4 bits of the (micro)Frame number in which the packet
     *  is received on the USB. This field is supported only when isochronous OUT endpoints
     *  are supported
     */
    uint32_t fn: 4;


} usb_grxstsp_reg_t;

/** Type of gsnpsid register
 *  Synopsys ID Register
 */
typedef volatile struct {
    /** synopsysid : RO; bitpos: [32:0]; default: 1330921482;
     *  ID register
     */
    uint32_t synopsysid: 32;


