espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
} usb_gsnpsid_reg_t;

/** Type of ghwcfg1 register
 *  User Hardware Configuration 1 Register
 */
typedef volatile struct {
    /** epdir : RO; bitpos: [32:0]; default: 0;
     *  This 32-bit field uses two bits per endpoint to determine the endpoint direction.
     *  Bits [31:30]: Endpoint 15 direction
     *  Bits [29:28]: Endpoint 14 direction
     *  ...
     *  Direction:
     *  2'b00: BIDIR (IN and OUT) endpoint
     *  2'b01: IN endpoint
     *  2'b10: OUT endpoint
     *  2'b11: Reserved
     */
    uint32_t epdir: 32;


} usb_ghwcfg1_reg_t;

/** Type of ghwcfg2 register
 *  User Hardware Configuration 2 Register
 */
typedef volatile struct {
    /** otgmode : RO; bitpos: [3:0]; default: 0;
     *  3'b000: HNP- and SRP-Capable OTG (Host  Device)
     */
    uint32_t otgmode: 3;
    /** otgarch : RO; bitpos: [5:3]; default: 2;
     *  2'b10: Internal DMA
     */
    uint32_t otgarch: 2;
    /** singpnt : RO; bitpos: [5]; default: 1;
     *  Point-to-Point
     *  1'b1: Single-point application (no hub and split support).
     */
    uint32_t singpnt: 1;
    /** hsphytype : RO; bitpos: [8:6]; default: 0;
     *  High-Speed PHY Interface Type
     *  2'b00: High-Speed interface not supported
     */
    uint32_t hsphytype: 2;
    /** fsphytype : RO; bitpos: [10:8]; default: 1;
     *  Full-Speed PHY Interface Type.
     */
    uint32_t fsphytype: 2;
    /** numdeveps : RO; bitpos: [14:10]; default: 6;
     *  Number of Device Endpoints.
     */
    uint32_t numdeveps: 4;
    /** numhstchnl : RO; bitpos: [18:14]; default: 7;
     *  Number of Host Channels.
     */
    uint32_t numhstchnl: 4;
    /** periosupport : RO; bitpos: [18]; default: 1;
     *  1'b0:Periodic OUT Channels is not Supported in Host Mode
     *  1'b1:Periodic OUT Channels Supported in Host Mode
     */
    uint32_t periosupport: 1;
    /** dynfifosizing : RO; bitpos: [19]; default: 1;
     *  1'b0:Dynamic FIFO Sizing Disabled
     *  1'b1:Dynamic FIFO Sizing Enabled
     */
    uint32_t dynfifosizing: 1;
    /** multiprocintrpt : RO; bitpos: [20]; default: 0;
     *  1'b0: No Multi Processor Interrupt Enabled
     *  1'b1:Multi Processor Interrupt Enabled
     */
    uint32_t multiprocintrpt: 1;
    uint32_t reserved_21: 1
    /** nptxqdepth : RO; bitpos: [24:22]; default: 1;
     *  Non-periodic Request Queue Depth
     *  2'b01: 4
     */
    uint32_t nptxqdepth: 2;
    /** ptxqdepth : RO; bitpos: [26:24]; default: 2;
     *  Host Mode Periodic Request Queue Depth.
     *  2'b10: 8
     */
    uint32_t ptxqdepth: 2;
    /** tknqdepth : RO; bitpos: [31:26]; default: 8;
     *  Device Mode IN Token Sequence Learning Queue Depth.
     */
    uint32_t tknqdepth: 5;
    /** otg_enable_ic_usb : RO; bitpos: [31]; default: 0;
     *  0x0 (DISABLE): Disabled the IC_USB Full-Speed Serial Transceiver interface
     *  0x1 (ENABLE): Enabled the IC_USB Full-Speed Serial Transceiver interface
     */
    uint32_t otg_enable_ic_usb: 1;


} usb_ghwcfg2_reg_t;

/** Type of ghwcfg3 register
 *  User Hardware Configuration 3 Register
 */
typedef volatile struct {
    /** xfersizewidth : RO; bitpos: [4:0]; default: 5;
     *  Width of Transfer Size Counters
     *  0x5 (WIDTH16): Width of Transfer Size Counter 16 bits
     */
    uint32_t xfersizewidth: 4;
    /** pktsizewidth : RO; bitpos: [7:4]; default: 3;
     *  Width of Packet Size Counters
     *  3'b011: 7 bits
     */
    uint32_t pktsizewidth: 3;
    /** otgen : RO; bitpos: [7]; default: 1;
     *  OTG Function Enabled.
     */
    uint32_t otgen: 1;
    /** i2cintsel : RO; bitpos: [8]; default: 0;
     *  1'b0: I2C Interface is not available on the controller.
     */
    uint32_t i2cintsel: 1;
    /** vndctlsupt : RO; bitpos: [9]; default: 0;
     *  Vendor Control Interface is not available .
     */
    uint32_t vndctlsupt: 1;
    /** optfeature : RO; bitpos: [10]; default: 1;
     *  Optional Features have been Removed.
     */
    uint32_t optfeature: 1;
    /** rsttype : RO; bitpos: [11]; default: 0;
     *  Asynchronous reset is used in the core
     */
    uint32_t rsttype: 1;
    /** adpsupport : RO; bitpos: [12]; default: 0;
     *  ADP logic is not present along with the controller.
     */
    uint32_t adpsupport: 1;
    /** hsicmode : RO; bitpos: [13]; default: 0;
     *  HSIC mode specified for Mode of Operation.
     *  1'b0: Non-HSIC-capable
     */
    uint32_t hsicmode: 1;
    /** bcsupport : RO; bitpos: [14]; default: 0;
     *  1'b0: No Battery Charger Support
     */
    uint32_t bcsupport: 1;
    /** lpmmode : RO; bitpos: [15]; default: 0;
     *  LPM mode specified for Mode of Operation.
     */
    uint32_t lpmmode: 1;
    /** dfifodepth : RO; bitpos: [32:16]; default: 256;
     *  DFIFO Depth.This value is in terms of 32-bit words.
     */
    uint32_t dfifodepth: 16;


} usb_ghwcfg3_reg_t;

/** Type of ghwcfg4 register
 *  User Hardware Configuration 4 Register
 */
typedef volatile struct {
    /** g_numdevperioeps : RO; bitpos: [4:0]; default: 0;
     *  Number of Device Mode Periodic IN Endpoints.
     */
    uint32_t g_numdevperioeps: 4;
    /** g_partialpwrdn : RO; bitpos: [4]; default: 1;
     *  Enable Partial Power Down.
     */
    uint32_t g_partialpwrdn: 1;
    /** g_ahbfreq : RO; bitpos: [5]; default: 1;
     *  Minimum AHB Frequency Less Than 60 MHz
     */
    uint32_t g_ahbfreq: 1;
    /** g_hibernation : RO; bitpos: [6]; default: 0;
     *  1'b0: Hibernation feature not enabled.
     */
    uint32_t g_hibernation: 1;
    /** g_extendedhibernation : RO; bitpos: [7]; default: 0;
     *  Extended Hibernation feature not enabled
     */
    uint32_t g_extendedhibernation: 1;
    uint32_t reserved_8: 4
    /** g_acgsupt : RO; bitpos: [12]; default: 0;
     *  Active Clock Gating is not enabled.
     */
    uint32_t g_acgsupt: 1;
    /** g_enhancedlpmsupt : RO; bitpos: [13]; default: 1;
     *  Enhanced LPM Support.
     */
    uint32_t g_enhancedlpmsupt: 1;
    /** g_phydatawidth : RO; bitpos: [16:14]; default: 2;
     *  UTMI+ PHY/ULPI-to-Internal UTMI+ Wrapper Data Width (PhyDataWidth) When a ULPI PHY
     *  is used, an internal wrapper converts ULPI to UTMI+
     *  2'b10: 8/16 bits, software selectable
     */
    uint32_t g_phydatawidth: 2;
    /** g_numctleps : RO; bitpos: [20:16]; default: 0;
     *  Number of Device Mode Control Endpoints in Addition to Endpoint 0
     */
    uint32_t g_numctleps: 4;
    /** g_iddqfltr : RO; bitpos: [20]; default: 1;
     *  IDDIG Filter Enable.
     */
    uint32_t g_iddqfltr: 1;
    /** g_vbusvalidfltr : RO; bitpos: [21]; default: 1;
     *  VBUS Valid Filter Enabled.
     */
    uint32_t g_vbusvalidfltr: 1;
    /** g_avalidfltr : RO; bitpos: [22]; default: 1;
     *  a_valid Filter Enabled.
     */
    uint32_t g_avalidfltr: 1;
    /** g_bvalidfltr : RO; bitpos: [23]; default: 1;
     *  b_valid Filter Enabled.
     */
    uint32_t g_bvalidfltr: 1;
    /** g_sessendfltr : RO; bitpos: [24]; default: 1;
     *  session_end Filter Enabled.
     */
    uint32_t g_sessendfltr: 1;
    /** g_dedfifomode : RO; bitpos: [25]; default: 1;
     *  Enable Dedicated Transmit FIFO for device IN Endpoints
     */
    uint32_t g_dedfifomode: 1;
    /** g_ineps : RO; bitpos: [30:26]; default: 4;
     *  Number of Device Mode IN Endpoints Including Control Endpoints.
     */
    uint32_t g_ineps: 4;
    /** g_descdmaenabled : RO; bitpos: [30]; default: 1;
     *  0x1: Scatter/Gather DMA configuration.
     */
    uint32_t g_descdmaenabled: 1;
    /** g_descdma : RO; bitpos: [31]; default: 1;
     *  Scatter/Gather DMA configuration
     *  1'b1: Dynamic configuration
     */
    uint32_t g_descdma: 1;


} usb_ghwcfg4_reg_t;

/** Type of hfnum register
 *  Frame Number configure Resigster
 */
typedef volatile struct {
    /** frnum : RO; bitpos: [14:0]; default: 16383;
     *  Frame Number
     *  0x0 (INACTIVE): No SOF is transmitted
     *  0x1 (ACTIVE): SOF is transmitted
     */
    uint32_t frnum: 14;
    uint32_t reserved_14: 2
    /** frrem : RO; bitpos: [32:16]; default: 0;
     *  Frame Time Remaining.ndicates the amount of time remaining in the current
     *  microframe
     *  (HS) or Frame (FS/LS), in terms of PHY clocks.
     */
    uint32_t frrem: 16;


