espressif/esp-idf/components/soc/esp32s2/include/soc/usb_struct.h
} usb_hfnum_reg_t;

/** Type of hptxsts register
 *  Host Periodic Transmit FIFO/Queue Status Register
 */
typedef volatile struct {
    /** ptxfspcavail : RO; bitpos: [16:0]; default: 256;
     *  Periodic Transmit Data FIFO Space Available. Values are in terms of 32-bit words.
     */
    uint32_t ptxfspcavail: 16;
    /** ptxqspcavail : RO; bitpos: [21:16]; default: 8;
     *  Periodic Transmit Request Queue Space Available.
     */
    uint32_t ptxqspcavail: 5;
    uint32_t reserved_21: 3
    /** ptxqtop : RO; bitpos: [32:24]; default: 0;
     *  Bit [31]: Odd/Even (micro)Frame. 1'b0: send in even (micro)Frame
     *  Bits [30:27]: Channel/endpoint number
     *  Bits [26:25]: Type. 2'b00: IN/OUT.   2'b01: Zero-length packet.     2'b10: CSPLIT
     *    2'b11: Disable channel command
     *  Bit [24]: Terminate
     */
    uint32_t ptxqtop: 8;


} usb_hptxsts_reg_t;

/** Type of hcdmab$n register
 *  Host Channel $n DMA Buffer Address Register
 */
typedef volatile struct {
    /** h_hcdmab0 : RO; bitpos: [32:0]; default: 0;
     *  Holds the current buffer address
     */
    uint32_t h_hcdmab0: 32;


} usb_hcdmab$n_reg_t;

/** Type of hcdmabn register
 *  Host Channel n DMA Buffer Address Register
 */
typedef volatile struct {
    /** h_hcdmabn : RO; bitpos: [32:0]; default: 0;
     *  Holds the current buffer address
     */
    uint32_t h_hcdmabn: 32;


} usb_hcdmabn_reg_t;

/** Type of dsts register
 *  Device Status Register
 */
typedef volatile struct {
    /** suspsts : RO; bitpos: [0]; default: 0;
     *  Suspend Status
     *  0x0 : No suspend state
     *  0x1 : Suspend state
     */
    uint32_t suspsts: 1;
    /** enumspd : RO; bitpos: [3:1]; default: 1;
     *  0x0 : High speed (PHY clock is running at 30 or 60 MHz)
     *  0x1 : Full speed (PHY clock is running at 30 or 60 MHz)
     *  0x2 : Low speed (PHY clock is running at 6 MHz)
     *  0x3 : Full speed (PHY clock is running at 48 MHz)
     */
    uint32_t enumspd: 2;
    /** errticerr : RO; bitpos: [3]; default: 0;
     *  0x0 : No Erratic Error
     *  0x1 : Erratic Error
     */
    uint32_t errticerr: 1;
    uint32_t reserved_4: 4
    /** soffn : RO; bitpos: [22:8]; default: 0;
     *  Frame or Microframe Number of the Received SOF (SOFFN).  This field contains a
     *  Frame number.
     */
    uint32_t soffn: 14;
    /** devlnsts : RO; bitpos: [24:22]; default: 0;
     *  Device Line Status
     *  DevLnSts[1]: Logic level of D+
     *  DevLnSts[0]: Logic level of D-
     */
    uint32_t devlnsts: 2;


} usb_dsts_reg_t;

/** Type of dtxfstsn register
 *  Device IN Endpoint Transmit FIFO Status Register n
 */
typedef volatile struct {
    /** d_ineptxfspcavailn : RO; bitpos: [16:0]; default: 0;
     *  Indicates the amount of free space available in the Endpoint  TxFIFO.
     */
    uint32_t d_ineptxfspcavailn: 16;


} usb_dtxfstsn_reg_t;

/** Type of diepdmabn register
 *  Device IN Endpoint 16 Buffer Address Register
 */
typedef volatile struct {
    /** d_dmabufferaddrn : RO; bitpos: [32:0]; default: 0;
     *  Holds the current buffer address.This register is updated as and when the data
     *  transfer for the corresponding end point is in progress. This register is present
     *  only in Scatter/Gather DMA mode. Otherwise this field is reserved.
     */
    uint32_t d_dmabufferaddrn: 32;


} usb_diepdmabn_reg_t;



typedef struct {
    volatile usb_gotgctl_reg_t gotgctl;
    volatile usb_gdfifocfg_reg_t gdfifocfg;
    volatile usb_hptxfsiz_reg_t hptxfsiz;
    union {
        volatile usb_dieptxfn_reg_t dieptxfn[4];
        struct {
            volatile usb_dieptxfn_reg_t dieptxf1;
            volatile usb_dieptxfn_reg_t dieptxf2;
            volatile usb_dieptxfn_reg_t dieptxf3;
            volatile usb_dieptxfn_reg_t dieptxf4;
        };
    };
    volatile usb_hcfg_reg_t hcfg;
    volatile usb_hfir_reg_t hfir;
    volatile usb_hflbaddr_reg_t hflbaddr;
    volatile usb_hprt_reg_t hprt;
    union {
        volatile usb_hccharn_reg_t hccharn[8];
        struct {
            volatile usb_hccharn_reg_t hcchar0;
            volatile usb_hccharn_reg_t hcchar1;
            volatile usb_hccharn_reg_t hcchar2;
            volatile usb_hccharn_reg_t hcchar3;
            volatile usb_hccharn_reg_t hcchar4;
            volatile usb_hccharn_reg_t hcchar5;
            volatile usb_hccharn_reg_t hcchar6;
            volatile usb_hccharn_reg_t hcchar7;
        };
    };
    union {
        volatile usb_hcdman_reg_t hcdman[8];
        struct {
            volatile usb_hcdman_reg_t hcdma0;
            volatile usb_hcdman_reg_t hcdma1;
            volatile usb_hcdman_reg_t hcdma2;
            volatile usb_hcdman_reg_t hcdma3;
            volatile usb_hcdman_reg_t hcdma4;
            volatile usb_hcdman_reg_t hcdma5;
            volatile usb_hcdman_reg_t hcdma6;
            volatile usb_hcdman_reg_t hcdma7;
        };
    };
    volatile usb_dcfg_reg_t dcfg;
    volatile usb_dctl_reg_t dctl;
    volatile usb_dvbusdis_reg_t dvbusdis;
    volatile usb_dvbuspulse_reg_t dvbuspulse;
    volatile usb_dthrctl_reg_t dthrctl;
    volatile usb_diepctl0_reg_t diepctl0;
    union {
        volatile usb_dieptsizn_reg_t dieptsizn[7];
        struct {
            volatile usb_dieptsizn_reg_t dieptsiz0;
            volatile usb_dieptsizn_reg_t dieptsiz1;
            volatile usb_dieptsizn_reg_t dieptsiz2;
            volatile usb_dieptsizn_reg_t dieptsiz3;
            volatile usb_dieptsizn_reg_t dieptsiz4;
            volatile usb_dieptsizn_reg_t dieptsiz5;
            volatile usb_dieptsizn_reg_t dieptsiz6;
        };
    };
    union {
        volatile usb_diepdman_reg_t diepdman[7];
        struct {
            volatile usb_diepdman_reg_t diepdma0;
            volatile usb_diepdman_reg_t diepdma1;
            volatile usb_diepdman_reg_t diepdma2;
            volatile usb_diepdman_reg_t diepdma3;
            volatile usb_diepdman_reg_t diepdma4;
            volatile usb_diepdman_reg_t diepdma5;
            volatile usb_diepdman_reg_t diepdma6;
        };
    };
    volatile usb_diepctl1_reg_t diepctl1;
    volatile usb_diepctl2_reg_t diepctl2;
    volatile usb_diepctl3_reg_t diepctl3;
    volatile usb_diepctl4_reg_t diepctl4;
    volatile usb_diepctl5_reg_t diepctl5;
    volatile usb_diepctl6_reg_t diepctl6;
    volatile usb_doepctl0_reg_t doepctl0;
    union {
        volatile usb_doeptsizn_reg_t doeptsizn[7];
        struct {
            volatile usb_doeptsizn_reg_t doeptsiz0;
            volatile usb_doeptsizn_reg_t doeptsiz1;
            volatile usb_doeptsizn_reg_t doeptsiz2;
            volatile usb_doeptsizn_reg_t doeptsiz3;
            volatile usb_doeptsizn_reg_t doeptsiz4;
            volatile usb_doeptsizn_reg_t doeptsiz5;
            volatile usb_doeptsizn_reg_t doeptsiz6;
        };
    };
    union {
        volatile usb_doepdman_reg_t doepdman[7];
        struct {
            volatile usb_doepdman_reg_t doepdma0;
            volatile usb_doepdman_reg_t doepdma1;
            volatile usb_doepdman_reg_t doepdma2;
            volatile usb_doepdman_reg_t doepdma3;
            volatile usb_doepdman_reg_t doepdma4;
            volatile usb_doepdman_reg_t doepdma5;
            volatile usb_doepdman_reg_t doepdma6;
        };
    };
    union {
        volatile usb_doepdmabn_reg_t doepdmabn[7];
        struct {
            volatile usb_doepdmabn_reg_t doepdmab0;
            volatile usb_doepdmabn_reg_t doepdmab1;
            volatile usb_doepdmabn_reg_t doepdmab2;
            volatile usb_doepdmabn_reg_t doepdmab3;
            volatile usb_doepdmabn_reg_t doepdmab4;
            volatile usb_doepdmabn_reg_t doepdmab5;
            volatile usb_doepdmabn_reg_t doepdmab6;
        };
    };
    union {
        volatile usb_doepctln_reg_t doepctln[6];
        struct {
            volatile usb_doepctln_reg_t doepctl1;
            volatile usb_doepctln_reg_t doepctl2;
            volatile usb_doepctln_reg_t doepctl3;
            volatile usb_doepctln_reg_t doepctl4;
            volatile usb_doepctln_reg_t doepctl5;
            volatile usb_doepctln_reg_t doepctl6;
        };
    };
    volatile usb_pcgcctl_reg_t pcgcctl;
    volatile usb_gotgint_reg_t gotgint;
    volatile usb_gintsts_reg_t gintsts;
    volatile usb_gintmsk_reg_t gintmsk;
    volatile usb_haint_reg_t haint;
    volatile usb_haintmsk_reg_t haintmsk;
    union {
        volatile usb_hcintn_reg_t hcintn[8];
        struct {
            volatile usb_hcintn_reg_t hcint0;
            volatile usb_hcintn_reg_t hcint1;
            volatile usb_hcintn_reg_t hcint2;
            volatile usb_hcintn_reg_t hcint3;
            volatile usb_hcintn_reg_t hcint4;
            volatile usb_hcintn_reg_t hcint5;
            volatile usb_hcintn_reg_t hcint6;
            volatile usb_hcintn_reg_t hcint7;
        };
    };
    union {
        volatile usb_hcintmskn_reg_t hcintmskn[8];
        struct {
            volatile usb_hcintmskn_reg_t hcintmsk0;
            volatile usb_hcintmskn_reg_t hcintmsk1;
            volatile usb_hcintmskn_reg_t hcintmsk2;
            volatile usb_hcintmskn_reg_t hcintmsk3;
            volatile usb_hcintmskn_reg_t hcintmsk4;
            volatile usb_hcintmskn_reg_t hcintmsk5;
            volatile usb_hcintmskn_reg_t hcintmsk6;
            volatile usb_hcintmskn_reg_t hcintmsk7;
        };
    };
    volatile usb_diepmsk_reg_t diepmsk;
    volatile usb_doepmsk_reg_t doepmsk;
    volatile usb_daint_reg_t daint;
    volatile usb_daintmsk_reg_t daintmsk;
    volatile usb_diepempmsk_reg_t diepempmsk;
    union {
        volatile usb_diepintn_reg_t diepintn[7];
        struct {
            volatile usb_diepintn_reg_t diepint0;
            volatile usb_diepintn_reg_t diepint1;
            volatile usb_diepintn_reg_t diepint2;
            volatile usb_diepintn_reg_t diepint3;
            volatile usb_diepintn_reg_t diepint4;
            volatile usb_diepintn_reg_t diepint5;
            volatile usb_diepintn_reg_t diepint6;
        };
    };
    union {
        volatile usb_doepintn_reg_t doepintn[7];
        struct {
            volatile usb_doepintn_reg_t doepint0;
            volatile usb_doepintn_reg_t doepint1;
            volatile usb_doepintn_reg_t doepint2;
            volatile usb_doepintn_reg_t doepint3;
            volatile usb_doepintn_reg_t doepint4;
            volatile usb_doepintn_reg_t doepint5;
            volatile usb_doepintn_reg_t doepint6;
        };
    };
    volatile usb_gahbcfg_reg_t gahbcfg;
    volatile usb_gusbcfg_reg_t gusbcfg;
    volatile usb_grstctl_reg_t grstctl;
    volatile usb_grxfsiz_reg_t grxfsiz;
    volatile usb_gnptxfsiz_reg_t gnptxfsiz;
    volatile usb_gnptxsts_reg_t gnptxsts;
    union {
        volatile usb_hctsizn_reg_t hctsizn[8];
        struct {
            volatile usb_hctsizn_reg_t hctsiz0;
            volatile usb_hctsizn_reg_t hctsiz1;
            volatile usb_hctsizn_reg_t hctsiz2;
            volatile usb_hctsizn_reg_t hctsiz3;
            volatile usb_hctsizn_reg_t hctsiz4;
            volatile usb_hctsizn_reg_t hctsiz5;
            volatile usb_hctsizn_reg_t hctsiz6;
            volatile usb_hctsizn_reg_t hctsiz7;
        };
    };
    volatile usb_grxstsr_reg_t grxstsr;
    volatile usb_grxstsp_reg_t grxstsp;
    volatile usb_gsnpsid_reg_t gsnpsid;
    volatile usb_ghwcfg1_reg_t ghwcfg1;
    volatile usb_ghwcfg2_reg_t ghwcfg2;
    volatile usb_ghwcfg3_reg_t ghwcfg3;
    volatile usb_ghwcfg4_reg_t ghwcfg4;
    volatile usb_hfnum_reg_t hfnum;
    volatile usb_hptxsts_reg_t hptxsts;
    volatile usb_hcdmab$n_reg_t hcdmab$n;
    union {
        volatile usb_hcdmabn_reg_t hcdmabn[7];
        struct {
            volatile usb_hcdmabn_reg_t hcdmab1;
            volatile usb_hcdmabn_reg_t hcdmab2;
            volatile usb_hcdmabn_reg_t hcdmab3;
            volatile usb_hcdmabn_reg_t hcdmab4;
            volatile usb_hcdmabn_reg_t hcdmab5;
            volatile usb_hcdmabn_reg_t hcdmab6;
            volatile usb_hcdmabn_reg_t hcdmab7;
        };
    };
    volatile usb_dsts_reg_t dsts;
    union {
        volatile usb_dtxfstsn_reg_t dtxfstsn[7];
        struct {
            volatile usb_dtxfstsn_reg_t dtxfsts0;
            volatile usb_dtxfstsn_reg_t dtxfsts1;
            volatile usb_dtxfstsn_reg_t dtxfsts2;
            volatile usb_dtxfstsn_reg_t dtxfsts3;
            volatile usb_dtxfstsn_reg_t dtxfsts4;
            volatile usb_dtxfstsn_reg_t dtxfsts5;
            volatile usb_dtxfstsn_reg_t dtxfsts6;
        };
    };
    union {
        volatile usb_diepdmabn_reg_t diepdmabn[7];
        struct {
            volatile usb_diepdmabn_reg_t diepdmab0;
            volatile usb_diepdmabn_reg_t diepdmab1;
            volatile usb_diepdmabn_reg_t diepdmab2;
            volatile usb_diepdmabn_reg_t diepdmab3;
            volatile usb_diepdmabn_reg_t diepdmab4;
            volatile usb_diepdmabn_reg_t diepdmab5;
            volatile usb_diepdmabn_reg_t diepdmab6;
        };
    };
} usb_dev_gen_t;

#ifdef __cplusplus
}
#endif
